-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /disk/homes2c/nber/lplatt/Ran/analysis_forjpe.log
  log type:  text
 opened on:   9 Aug 2013, 20:53:22

. 
. /* This .do file generates the results in Abramitzky, Boustan, Eriksson ("A Nation of Immigrants")*/
. 
. /* This .dta file is based on matched Census data from 1900-1920 for immigrants from 16 sending countries and a comparison sample of natives. An explanation for 
> how this dataset was created is presented in build_panel_forjpe.do*/
. use panel_all_forjpe.dta

. 
. /* Original dataset contains all migrants who arrived before 1900. For the analysis, we focus our attention on migrants who arrived between 1880-1900.*/
. keep if (yrimmig>=1880 | bpl<100)
(6673 observations deleted)

. 
. /* Create sample weights for the panel sample. The panel oversamples small countries so that we will have a large enough sample of observations from each 
> sending country. These weights are based on the distribution of the population between native and foreign born (and within country of origin for the 
> foreign born) from 1920 IPUMS sample*/ 
. gen weight2=9.86 if bpl==1
(54189 missing values generated)

. replace weight2=0.058 if bpl==400
(5460 real changes made)

. replace weight2=0.064 if bpl==401
(2469 real changes made)

. replace weight2=0.326 if bpl==404
(1134 real changes made)

. replace weight2=0.596 if bpl==405
(1537 real changes made)

. replace weight2=0.442 if bpl==410
(1697 real changes made)

. replace weight2=0.027 if bpl==411
(11013 real changes made)

. replace weight2=0.031 if bpl==412
(3256 real changes made)

. replace weight2=0.454 if bpl==414
(2403 real changes made)

. replace weight2=0.044 if bpl==420
(1499 real changes made)

. replace weight2=0.105 if bpl==421
(1843 real changes made)

. replace weight2=0.022 if bpl==426
(8984 real changes made)

. replace weight2=0.408 if bpl==434
(2352 real changes made)

. replace weight2=0.070 if bpl==436
(1683 real changes made)

. replace weight2=0.484 if bpl==450
(1004 real changes made)

. replace weight2=0.338 if bpl==453
(6005 real changes made)

. replace weight2=0.501 if bpl==465
(1850 real changes made)

. 
. /* Append in IPUMS data*/
. /* Create an indicator to differentiate between the IPUMS and the panel samples*/
. gen Panel=1

. append using 1900_20_ipums_01.dta
(label county_lbl already defined)

. *append using ipums_forjpe.dta
. replace Panel=0 if Panel==.
(206475 real changes made)

. /* Each of the IPUMS samples are representative of the population -- so the weight for IPUMS observations is set to 1*/
. replace weight2=1 if Panel==0
(206475 real changes made)

. 
. /* Convert dependent variables to 2010 dollars*/
. replace occscore_all=occscore_all*900
(259093 real changes made)

. replace income=income*26.8
income was int now float
(263167 real changes made)

. replace lnincome=ln(income)
(263167 real changes made)

. replace lnoccscore=ln(occscore_all)
(259093 real changes made)

. /* Dummy for foreign born*/
. replace fb=(bpl>100) if fb==.
(60156 real changes made)

. /* Interact the indicators for 'years in the US' categories with a dummy for being in the panel sample -- for the specifications that pool IPUMS and panel to 
> estimate equation (1) for repeated cross-section and panel together*/
. gen PIyrsusa2_1=Panel*Iyrsusa2_1
(3139 missing values generated)

. gen PIyrsusa2_2=Panel*Iyrsusa2_2
(3139 missing values generated)

. gen PIyrsusa2_3=Panel*Iyrsusa2_3
(3139 missing values generated)

. gen PIyrsusa2_4=Panel*Iyrsusa2_4
(3139 missing values generated)

. gen PIyrsusa2_5=Panel*Iyrsusa2_5
(3139 missing values generated)

. /* Do the same for the indicator for being in the after 1890 arrival cohort*/
. gen PC1=Panel*C1
(3139 missing values generated)

. /* Generate consistent Census year fixed effects*/
. drop Y*

. xi, pref(Y) i.year
i.year            Yyear_1900-1920     (naturally coded; Yyear_1900 omitted)

. 
. /* Appendix Table 1: This table reports mean occupation-based earnings for natives and foreign born and then compares the occupation-based earnings for men in 
> the representative population sample (IPUMS) and the panel sample in 1920*/
. /*Mean earnings*/
. tab fb if year==1920 & Panel==1 [aw=weight2], summ(occscore_all)

      =1 if |   Summary of Occupation-based earnings, using
    foreign |              1950 occupation score
       born |        Mean   Std. Dev.       Freq.        Obs.
------------+------------------------------------------------
          0 |    23185.62   10674.427    11269.98        1143
          1 |   23405.832   8645.5534    2829.584       16854
------------+------------------------------------------------
      Total |   23229.813   10296.118   14099.564       17997

. /*Regressions comparing representative sample to panel sample for natives and then for foreign born*/
. reg occscore_all Panel if fb==0 & year==1920

      Source |       SS       df       MS              Number of obs =   52517
-------------+------------------------------           F(  1, 52515) =    0.01
       Model |  1584309.63     1  1584309.63           Prob > F      =  0.9053
    Residual |  5.8787e+12 52515   111943614           R-squared     =  0.0000
-------------+------------------------------           Adj R-squared = -0.0000
       Total |  5.8787e+12 52516   111941513           Root MSE      =   10580

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |   37.64223   316.4134     0.12   0.905    -582.5309    657.8153
       _cons |   23147.98   46.67969   495.89   0.000     23056.48    23239.47
------------------------------------------------------------------------------

. reg occscore_all Panel if fb==1 & year==1920 [pw=weight2]
(sum of wgt is   1.3178e+04)

Linear regression                                      Number of obs =   27202
                                                       F(  1, 27200) =    5.31
                                                       Prob > F      =  0.0213
                                                       R-squared     =  0.0002
                                                       Root MSE      =  8792.1

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |   303.6287   131.8165     2.30   0.021     45.26162    561.9958
       _cons |    23102.2   86.81961   266.09   0.000     22932.03    23272.37
------------------------------------------------------------------------------

. /* Add country-of-origin FE*/
. reg occscore_all Panel T* if fb==1 & year==1920 [pw=weight2]
(sum of wgt is   1.3178e+04)

Linear regression                                      Number of obs =   27202
                                                       F( 16, 27185) =   43.46
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0433
                                                       Root MSE      =  8602.9

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |   303.1863   129.7208     2.34   0.019     48.92677    557.4457
   Tbpl1_400 |  -1480.643   447.4825    -3.31   0.001    -2357.732   -603.5546
   Tbpl1_401 |  -4257.431   448.7144    -9.49   0.000    -5136.935   -3377.928
   Tbpl1_404 |  -2266.106   399.8746    -5.67   0.000    -3049.881   -1482.331
   Tbpl1_405 |  -1268.344   298.8029    -4.24   0.000    -1854.013   -682.6751
   Tbpl1_410 |     2756.5   306.6385     8.99   0.000     2155.473    3357.527
   Tbpl1_411 |    3292.53   422.3024     7.80   0.000     2464.796    4120.265
   Tbpl1_412 |   2335.599   685.2093     3.41   0.001     992.5535    3678.644
   Tbpl1_414 |   757.0323   255.9394     2.96   0.003     255.3779    1258.687
   Tbpl1_420 |  -2358.342   870.6473    -2.71   0.007    -4064.855   -651.8284
   Tbpl1_421 |   696.1916    540.575     1.29   0.198    -363.3631    1755.746
   Tbpl1_426 |   -1979.45   569.6805    -3.47   0.001    -3096.054   -862.8474
   Tbpl1_436 |   -2876.07   587.1426    -4.90   0.000      -4026.9    -1725.24
   Tbpl1_450 |   899.9281   353.1349     2.55   0.011     207.7656     1592.09
   Tbpl1_453 |   22.11084   239.9151     0.09   0.927     -448.135    492.3567
   Tbpl1_465 |   3811.981   313.1056    12.17   0.000     3198.278    4425.684
       _cons |   22613.99   191.1039   118.33   0.000     22239.42    22988.57
------------------------------------------------------------------------------

. /* Use ln(occscore) as DV*/
. reg lnoccscore Panel if fb==1 & year==1920 [pw=weight2]
(sum of wgt is   1.3178e+04)

Linear regression                                      Number of obs =   27202
                                                       F(  1, 27200) =   11.72
                                                       Prob > F      =  0.0006
                                                       R-squared     =  0.0004
                                                       Root MSE      =  .39437

------------------------------------------------------------------------------
             |               Robust
  lnoccscore |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |   .0199076    .005815     3.42   0.001     .0085098    .0313054
       _cons |   9.972146   .0039253  2540.48   0.000     9.964452    9.979839
------------------------------------------------------------------------------

. reg lnoccscore Panel T* if fb==1 & year==1920 [pw=weight2]
(sum of wgt is   1.3178e+04)

Linear regression                                      Number of obs =   27202
                                                       F( 16, 27185) =   46.87
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0477
                                                       Root MSE      =  .38504

------------------------------------------------------------------------------
             |               Robust
  lnoccscore |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |    .020702   .0057152     3.62   0.000     .0094998    .0319041
   Tbpl1_400 |  -.1081189   .0210775    -5.13   0.000     -.149432   -.0668059
   Tbpl1_401 |  -.2136457   .0229029    -9.33   0.000    -.2585366   -.1687548
   Tbpl1_404 |  -.1426291   .0184305    -7.74   0.000    -.1787538   -.1065044
   Tbpl1_405 |  -.0861051   .0137295    -6.27   0.000    -.1130155   -.0591947
   Tbpl1_410 |   .1056371   .0130865     8.07   0.000     .0799868    .1312874
   Tbpl1_411 |   .1321074   .0179459     7.36   0.000     .0969325    .1672822
   Tbpl1_412 |   .0931631   .0295916     3.15   0.002      .035162    .1511641
   Tbpl1_414 |   .0319142   .0112297     2.84   0.004     .0099035     .053925
   Tbpl1_420 |  -.1455427   .0437083    -3.33   0.001    -.2312133   -.0598722
   Tbpl1_421 |   .0074304    .024069     0.31   0.758    -.0397462     .054607
   Tbpl1_426 |  -.1383066   .0267526    -5.17   0.000    -.1907431   -.0858701
   Tbpl1_436 |  -.1454342     .02892    -5.03   0.000    -.2021188   -.0887496
   Tbpl1_450 |   .0305017   .0153339     1.99   0.047     .0004464     .060557
   Tbpl1_453 |  -.0229078   .0106377    -2.15   0.031    -.0437583   -.0020573
   Tbpl1_465 |   .1419623   .0126497    11.22   0.000     .1171682    .1667564
       _cons |   9.969541   .0081388  1224.94   0.000     9.953588    9.985493
------------------------------------------------------------------------------

. /*Separately by country of origin - etc.*/
. foreach num of numlist 400 401 404 405 410 411 412 414 420 421 426 434 436 450 453 465 {
  2.         reg occscore_all Panel if bpl==`num' & year==1920
  3. }

      Source |       SS       df       MS              Number of obs =    2017
-------------+------------------------------           F(  1,  2015) =    0.73
       Model |  65132089.7     1  65132089.7           Prob > F      =  0.3939
    Residual |  1.8046e+11  2015  89560132.2           R-squared     =  0.0004
-------------+------------------------------           Adj R-squared = -0.0001
       Total |  1.8053e+11  2016  89548015.1           Root MSE      =  9463.6

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |   498.2564   584.2688     0.85   0.394    -647.5777     1644.09
       _cons |   21086.13   537.4976    39.23   0.000     20032.02    22140.24
------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =     922
-------------+------------------------------           F(  1,   920) =    0.11
       Model |  4769303.71     1  4769303.71           Prob > F      =  0.7450
    Residual |  4.1455e+10   920    45060052           R-squared     =  0.0001
-------------+------------------------------           Adj R-squared = -0.0010
       Total |  4.1460e+10   921  45016305.2           Root MSE      =  6712.7

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |   192.3222   591.1501     0.33   0.745     -967.837    1352.481
       _cons |   18383.23   539.1753    34.10   0.000     17325.07    19441.38
------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =     843
-------------+------------------------------           F(  1,   841) =    7.29
       Model |   552216070     1   552216070           Prob > F      =  0.0071
    Residual |  6.3704e+10   841  75748447.1           R-squared     =  0.0086
-------------+------------------------------           Adj R-squared =  0.0074
       Total |  6.4257e+10   842  76314323.2           Root MSE      =  8703.4

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |  -1633.458    604.979    -2.70   0.007    -2820.904   -446.0119
       _cons |   20733.89   398.0823    52.08   0.000     19952.54    21515.24
------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =    1484
-------------+------------------------------           F(  1,  1482) =    0.38
       Model |  29216414.1     1  29216414.1           Prob > F      =  0.5353
    Residual |  1.1263e+11  1482  75995729.3           R-squared     =  0.0003
-------------+------------------------------           Adj R-squared = -0.0004
       Total |  1.1265e+11  1483  75964185.6           Root MSE      =  8717.6

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |   298.9833    482.201     0.62   0.535    -646.8858    1244.853
       _cons |   21346.59   275.9493    77.36   0.000      20805.3    21887.89
------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =    1465
-------------+------------------------------           F(  1,  1463) =    0.21
       Model |  15586406.5     1  15586406.5           Prob > F      =  0.6487
    Residual |  1.0980e+11  1463  75052812.7           R-squared     =  0.0001
-------------+------------------------------           Adj R-squared = -0.0005
       Total |  1.0982e+11  1464  75012193.6           Root MSE      =  8663.3

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |  -213.5632   468.6374    -0.46   0.649    -1132.836    705.7097
       _cons |   25477.22   285.3107    89.30   0.000     24917.56    26036.89
------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =    3790
-------------+------------------------------           F(  1,  3788) =    0.01
       Model |  603317.523     1  603317.523           Prob > F      =  0.9265
    Residual |  2.6843e+11  3788  70862181.8           R-squared     =  0.0000
-------------+------------------------------           Adj R-squared = -0.0003
       Total |  2.6843e+11  3789    70843639           Root MSE      =    8418

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |  -46.94778   508.8026    -0.09   0.926    -1044.501    950.6058
       _cons |   25990.91     488.46    53.21   0.000     25033.24    26948.58
------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =    1091
-------------+------------------------------           F(  1,  1089) =    0.25
       Model |  14174271.4     1  14174271.4           Prob > F      =  0.6170
    Residual |  6.1692e+10  1089  56649766.2           R-squared     =  0.0002
-------------+------------------------------           Adj R-squared = -0.0007
       Total |  6.1706e+10  1090  56610797.8           Root MSE      =  7526.6

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |  -398.6347   796.9366    -0.50   0.617     -1962.34     1165.07
       _cons |   25117.35   760.3018    33.04   0.000     23625.52    26609.17
------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =    2148
-------------+------------------------------           F(  1,  2146) =    9.25
       Model |   551905548     1   551905548           Prob > F      =  0.0024
    Residual |  1.2805e+11  2146  59667691.3           R-squared     =  0.0043
-------------+------------------------------           Adj R-squared =  0.0038
       Total |  1.2860e+11  2147  59896959.1           Root MSE      =  7724.5

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |   1056.709   347.4502     3.04   0.002     375.3347    1738.083
       _cons |    23218.3   208.1626   111.54   0.000     22810.08    23626.52
------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =     523
-------------+------------------------------           F(  1,   521) =    2.63
       Model |   164884701     1   164884701           Prob > F      =  0.1053
    Residual |  3.2624e+10   521  62617178.8           R-squared     =  0.0050
-------------+------------------------------           Adj R-squared =  0.0031
       Total |  3.2788e+10   522  62813093.6           Root MSE      =  7913.1

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |   1701.969   1048.837     1.62   0.105    -358.5013    3762.439
       _cons |   19924.62   981.4995    20.30   0.000     17996.43     21852.8
------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =     724
-------------+------------------------------           F(  1,   722) =    3.22
       Model |   310046512     1   310046512           Prob > F      =  0.0733
    Residual |  6.9593e+10   722  96389766.3           R-squared     =  0.0044
-------------+------------------------------           Adj R-squared =  0.0031
       Total |  6.9903e+10   723  96685280.5           Root MSE      =  9817.8

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |   1492.524   832.1918     1.79   0.073    -141.2806    3126.329
       _cons |   23036.17   716.0388    32.17   0.000      21630.4    24441.94
------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =    2991
-------------+------------------------------           F(  1,  2989) =    0.46
       Model |  37811141.7     1  37811141.7           Prob > F      =  0.4964
    Residual |  2.4422e+11  2989  81704745.6           R-squared     =  0.0002
-------------+------------------------------           Adj R-squared = -0.0002
       Total |  2.4425e+11  2990  81690065.5           Root MSE      =  9039.1

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |   459.8566   675.9836     0.68   0.496    -865.5836    1785.297
       _cons |   20596.34    654.044    31.49   0.000     19313.91    21878.76
------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =    1958
-------------+------------------------------           F(  1,  1956) =    5.43
       Model |   334844216     1   334844216           Prob > F      =  0.0199
    Residual |  1.2059e+11  1956    61652624           R-squared     =  0.0028
-------------+------------------------------           Adj R-squared =  0.0023
       Total |  1.2093e+11  1957  61792221.2           Root MSE      =  7851.9

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |   863.4054   370.4837     2.33   0.020      136.821     1589.99
       _cons |   22510.71   221.2027   101.77   0.000      22076.9    22944.53
------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =     493
-------------+------------------------------           F(  1,   491) =    0.00
       Model |   266575.59     1   266575.59           Prob > F      =  0.9458
    Residual |  2.8334e+10   491  57705953.7           R-squared     =  0.0000
-------------+------------------------------           Adj R-squared = -0.0020
       Total |  2.8334e+10   492    57589207           Root MSE      =  7596.4

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |   54.98432   808.9822     0.07   0.946     -1534.51    1644.478
       _cons |   19784.35    708.372    27.93   0.000     18392.53    21176.16
------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =     851
-------------+------------------------------           F(  1,   849) =    1.74
       Model |   122823571     1   122823571           Prob > F      =  0.1880
    Residual |  6.0069e+10   849  70752660.6           R-squared     =  0.0020
-------------+------------------------------           Adj R-squared =  0.0009
       Total |  6.0192e+10   850  70813920.5           Root MSE      =  8411.5

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |  -784.7918   595.6416    -1.32   0.188    -1953.895    384.3109
       _cons |   23758.65    364.683    65.15   0.000     23042.86    24474.43
------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =    4285
-------------+------------------------------           F(  1,  4283) =    1.92
       Model |   144558185     1   144558185           Prob > F      =  0.1658
    Residual |  3.2234e+11  4283  75259651.1           R-squared     =  0.0004
-------------+------------------------------           Adj R-squared =  0.0002
       Total |  3.2248e+11  4284  75275827.3           Root MSE      =  8675.2

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |   368.7766   266.0867     1.39   0.166    -152.8911    890.4443
       _cons |   22621.62   179.6842   125.90   0.000     22269.35     22973.9
------------------------------------------------------------------------------

      Source |       SS       df       MS              Number of obs =    1617
-------------+------------------------------           F(  1,  1615) =    0.33
       Model |  30380202.2     1  30380202.2           Prob > F      =  0.5648
    Residual |  1.4798e+11  1615  91628441.6           R-squared     =  0.0002
-------------+------------------------------           Adj R-squared = -0.0004
       Total |  1.4801e+11  1616  91590540.5           Root MSE      =  9572.3

------------------------------------------------------------------------------
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       Panel |   285.1492    495.213     0.58   0.565    -686.1783    1256.477
       _cons |   26429.97   298.1164    88.66   0.000     25845.24    27014.71
------------------------------------------------------------------------------

. 
. /* Currently, the indicators Iyrs and C1 are non-zero for the cross section and the panel sample. So, the coefficients on P*Iyrs and P*C1 represent the 
> incremental difference between the cross section and panel samples. Instead, for ease of interpretation, we want the interactions P*Iyrs and P*C1 to represent 
> the ACTUAL value of, say, being in the US for 0-5 years for immigrants in the panel sample. So, we set the indicators Iyrs and C1 =0 for observations in the 
> panel sample. We also set the variable "Panel" =0 for immigrants in the panel sample so that it reflects earnings for native born in the panel sample only.*/
. foreach var of varlist Iyrs* {
  2. replace `var'=0 if Panel==1
  3. }
(4629 real changes made)
(7493 real changes made)
(19880 real changes made)
(19660 real changes made)
(12202 real changes made)

. /* Create a new indicator =1 for ALL observations in the panel sample (both native and foreign born)*/
. gen panel_flag=Panel

. replace Panel=0 if fb==1
(54189 real changes made)

. 
. /* Table 3: Baseline results*/
. /* Note that Figure 2 reports the coefficients on the Iyrs indicators for the cross section and repeated cross section and on (Iyrs + Panel) for the panel 
> sample*/
. /* Cross section only*/
. reg occscore_all age age2 age3 age4 I* P* T* Y* [pw=weight2] if panel_flag==0
(sum of wgt is   2.0546e+05)
note: Panel omitted because of collinearity
note: PIyrsusa2_1 omitted because of collinearity
note: PIyrsusa2_2 omitted because of collinearity
note: PIyrsusa2_3 omitted because of collinearity
note: PIyrsusa2_4 omitted because of collinearity
note: PIyrsusa2_5 omitted because of collinearity
note: PC1 omitted because of collinearity

Linear regression                                      Number of obs =  205458
                                                       F( 26,205431) =  389.98
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0347
                                                       Root MSE      =  9835.7

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   2490.457   426.4572     5.84   0.000     1654.611    3326.303
        age2 |  -67.55342   19.12819    -3.53   0.000    -105.0442   -30.06263
        age3 |   .7747898   .3664054     2.11   0.034     .0566441    1.492935
        age4 |  -.0032485   .0025397    -1.28   0.201    -.0082263    .0017293
  Iyrsusa2_1 |  -1255.735   143.4405    -8.75   0.000    -1536.875   -974.5948
  Iyrsusa2_2 |  -734.5165   147.4435    -4.98   0.000    -1023.502   -445.5309
  Iyrsusa2_3 |   -352.936   131.2688    -2.69   0.007    -610.2197    -95.6523
  Iyrsusa2_4 |  -294.8676   142.1068    -2.07   0.038    -573.3934   -16.34174
  Iyrsusa2_5 |   22.41575   184.6497     0.12   0.903    -339.4931    384.3246
       Panel |          0  (omitted)
 PIyrsusa2_1 |          0  (omitted)
 PIyrsusa2_2 |          0  (omitted)
 PIyrsusa2_3 |          0  (omitted)
 PIyrsusa2_4 |          0  (omitted)
 PIyrsusa2_5 |          0  (omitted)
         PC1 |          0  (omitted)
   Tbpl1_400 |  -2263.443   303.9908    -7.45   0.000    -2859.258   -1667.629
   Tbpl1_401 |  -1804.938   267.3671    -6.75   0.000    -2328.971   -1280.905
   Tbpl1_404 |  -2403.556   238.9542   -10.06   0.000      -2871.9   -1935.211
   Tbpl1_405 |  -1046.242   179.0482    -5.84   0.000    -1397.172   -695.3122
   Tbpl1_410 |   2127.216   184.7968    11.51   0.000     1765.019    2489.413
   Tbpl1_411 |   2622.081   288.3824     9.09   0.000     2056.858    3187.303
   Tbpl1_412 |   2320.018    473.035     4.90   0.000     1392.881    3247.155
   Tbpl1_414 |   659.7031    153.515     4.30   0.000     358.8176    960.5887
   Tbpl1_420 |   -1927.58   575.2042    -3.35   0.001    -3054.966   -800.1941
   Tbpl1_421 |   429.0222    428.429     1.00   0.317    -410.6882    1268.733
   Tbpl1_426 |  -2024.673   402.9679    -5.02   0.000     -2814.48   -1234.866
   Tbpl1_436 |    -3442.3   424.0421    -8.12   0.000    -4273.412   -2611.188
   Tbpl1_450 |   737.8348    176.336     4.18   0.000     392.2206    1083.449
   Tbpl1_453 |   367.7179   147.5299     2.49   0.013     78.56283     656.873
   Tbpl1_465 |   3135.225   186.5116    16.81   0.000     2769.667    3500.783
  Yyear_1910 |   816.1806    74.0006    11.03   0.000     671.1413      961.22
  Yyear_1920 |    1503.29   107.3617    14.00   0.000     1292.863    1713.716
       _cons |  -10859.83    3416.47    -3.18   0.001    -17556.03   -4163.635
------------------------------------------------------------------------------

. /* Repeated cross-section and panel (pooled)*/
. reg occscore_all age age2 age3 age4 I* P* C1 T* Y* [pw=weight2]
(sum of wgt is   2.4882e+05)

Linear regression                                      Number of obs =  259093
                                                       F( 34,259058) =  226.36
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0348
                                                       Root MSE      =  9853.4

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   3132.283   582.5821     5.38   0.000     1990.438    4274.128
        age2 |  -95.12097   26.06388    -3.65   0.000    -146.2055   -44.03647
        age3 |   1.268848   .4976206     2.55   0.011     .2935251    2.244171
        age4 |  -.0064514   .0034367    -1.88   0.060    -.0131872    .0002843
  Iyrsusa2_1 |  -384.4954   187.3031    -2.05   0.040    -751.6045    -17.3863
  Iyrsusa2_2 |  -2.891938   172.0516    -0.02   0.987    -340.1084    334.3245
  Iyrsusa2_3 |   173.8321   134.0204     1.30   0.195    -88.84425    436.5084
  Iyrsusa2_4 |   128.4394   138.9263     0.92   0.355    -143.8524    400.7312
  Iyrsusa2_5 |   155.7659   178.4948     0.87   0.383    -194.0792     505.611
       Panel |  -153.8329   176.1422    -0.87   0.382     -499.067    191.4011
 PIyrsusa2_1 |    293.505   237.9648     1.23   0.217    -172.8996    759.9097
 PIyrsusa2_2 |   467.6477   213.6066     2.19   0.029     48.98459    886.3109
 PIyrsusa2_3 |   329.3896   150.4912     2.19   0.029     34.43095    624.3483
 PIyrsusa2_4 |   74.34656   150.3348     0.49   0.621    -220.3056    368.9987
 PIyrsusa2_5 |   231.9007   186.5563     1.24   0.214    -133.7445     597.546
         PC1 |   507.7767   160.5802     3.16   0.002     193.0438    822.5095
          C1 |  -739.1812   106.9975    -6.91   0.000    -948.8935   -529.4689
   Tbpl1_400 |   -2327.62   237.5379    -9.80   0.000    -2793.188   -1862.052
   Tbpl1_401 |  -2192.508   218.5153   -10.03   0.000    -2620.792   -1764.224
   Tbpl1_404 |  -2773.699    203.218   -13.65   0.000    -3172.001   -2375.397
   Tbpl1_405 |  -1198.097   153.6924    -7.80   0.000     -1499.33   -896.8638
   Tbpl1_410 |   1931.525   159.0928    12.14   0.000     1619.707    2243.342
   Tbpl1_411 |   2443.896   233.7286    10.46   0.000     1985.794    2901.997
   Tbpl1_412 |   1907.884   369.4178     5.16   0.000     1183.835    2631.933
   Tbpl1_414 |   559.1174   132.6361     4.22   0.000     299.1542    819.0806
   Tbpl1_420 |  -1873.131    445.701    -4.20   0.000    -2746.693   -999.5695
   Tbpl1_421 |   475.9541   325.7875     1.46   0.144    -162.5807    1114.489
   Tbpl1_426 |  -2179.738   309.4491    -7.04   0.000     -2786.25   -1573.226
   Tbpl1_436 |  -3756.458   326.0346   -11.52   0.000    -4395.477   -3117.439
   Tbpl1_450 |   619.8555   155.0791     4.00   0.000     315.9046    923.8065
   Tbpl1_453 |   140.4735   127.4746     1.10   0.270    -109.3734    390.3203
   Tbpl1_465 |   3096.437   159.1077    19.46   0.000      2784.59    3408.284
  Yyear_1910 |      965.8    104.327     9.26   0.000     761.3219    1170.278
  Yyear_1920 |    1875.72   151.0886    12.41   0.000     1579.591     2171.85
       _cons |  -16108.58   4673.245    -3.45   0.001    -25268.02   -6949.149
------------------------------------------------------------------------------

. /* Test if difference between immigrants-natives is different across two samples*/
. test Iyrsusa2_1==(PIyrsusa2_1-Panel)

 ( 1)  Iyrsusa2_1 + Panel - PIyrsusa2_1 = 0

       F(  1,259058) =    7.20
            Prob > F =    0.0073

. test Iyrsusa2_2==(PIyrsusa2_2-Panel)

 ( 1)  Iyrsusa2_2 + Panel - PIyrsusa2_2 = 0

       F(  1,259058) =    5.02
            Prob > F =    0.0251

. test Iyrsusa2_3==(PIyrsusa2_3-Panel)

 ( 1)  Iyrsusa2_3 + Panel - PIyrsusa2_3 = 0

       F(  1,259058) =    1.98
            Prob > F =    0.1596

. test Iyrsusa2_4==(PIyrsusa2_4-Panel)

 ( 1)  Iyrsusa2_4 + Panel - PIyrsusa2_4 = 0

       F(  1,259058) =    0.19
            Prob > F =    0.6597

. test Iyrsusa2_5==(PIyrsusa2_5-Panel)

 ( 1)  Iyrsusa2_5 + Panel - PIyrsusa2_5 = 0

       F(  1,259058) =    0.78
            Prob > F =    0.3767

. 
. /* Table 6: Robustness*/
. /* No country FE*/
. reg occscore_all age age2 age3 age4 I* P* Y* [pw=weight2] if panel_flag==0
(sum of wgt is   2.0546e+05)
note: Panel omitted because of collinearity
note: PIyrsusa2_1 omitted because of collinearity
note: PIyrsusa2_2 omitted because of collinearity
note: PIyrsusa2_3 omitted because of collinearity
note: PIyrsusa2_4 omitted because of collinearity
note: PIyrsusa2_5 omitted because of collinearity
note: PC1 omitted because of collinearity

Linear regression                                      Number of obs =  205458
                                                       F( 11,205446) =  808.27
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0306
                                                       Root MSE      =    9856

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   2469.751   427.3919     5.78   0.000     1632.073    3307.428
        age2 |  -66.92523   19.16983    -3.49   0.000    -104.4976   -29.35283
        age3 |    .766672   .3672039     2.09   0.037     .0469614    1.486383
        age4 |  -.0032141   .0025453    -1.26   0.207    -.0082029    .0017746
  Iyrsusa2_1 |  -888.6727   115.9337    -7.67   0.000      -1115.9   -661.4454
  Iyrsusa2_2 |  -239.9544   108.0064    -2.22   0.026    -451.6442   -28.26457
  Iyrsusa2_3 |   164.9826   74.66975     2.21   0.027     18.63172    311.3335
  Iyrsusa2_4 |   177.5304    92.5681     1.92   0.055    -3.900812    358.9616
  Iyrsusa2_5 |   373.4994   142.9052     2.61   0.009     93.40862    653.5902
       Panel |          0  (omitted)
 PIyrsusa2_1 |          0  (omitted)
 PIyrsusa2_2 |          0  (omitted)
 PIyrsusa2_3 |          0  (omitted)
 PIyrsusa2_4 |          0  (omitted)
 PIyrsusa2_5 |          0  (omitted)
         PC1 |          0  (omitted)
  Yyear_1910 |   855.7567   73.94676    11.57   0.000     710.8229    1000.691
  Yyear_1920 |   1539.318   107.3558    14.34   0.000     1328.903    1749.732
       _cons |  -10635.01   3424.076    -3.11   0.002    -17346.12   -3923.906
------------------------------------------------------------------------------

. reg occscore_all age age2 age3 age4 I* P* C1 Y* [pw=weight2]
(sum of wgt is   2.4882e+05)

Linear regression                                      Number of obs =  259093
                                                       F( 19,259073) =  306.34
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0304
                                                       Root MSE      =  9875.5

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   3140.252   583.0511     5.39   0.000     1997.488    4283.017
        age2 |  -95.78014   26.08457    -3.67   0.000    -146.9052   -44.65509
        age3 |   1.285233   .4980139     2.58   0.010     .3091387    2.261326
        age4 |  -.0065863   .0034394    -1.91   0.055    -.0133274    .0001548
  Iyrsusa2_1 |  -216.0115   169.8689    -1.27   0.204      -548.95    116.9271
  Iyrsusa2_2 |   290.9774   144.8225     2.01   0.045     7.129269    574.8256
  Iyrsusa2_3 |   507.0873   92.39142     5.49   0.000     326.0026     688.172
  Iyrsusa2_4 |   424.6519   100.2778     4.23   0.000     228.1101    621.1937
  Iyrsusa2_5 |   339.1003   148.3964     2.29   0.022     48.24741    629.9533
       Panel |  -154.1241   176.1362    -0.88   0.382    -499.3462     191.098
 PIyrsusa2_1 |   558.4407   226.7074     2.46   0.014     114.1004    1002.781
 PIyrsusa2_2 |   717.5618   193.0461     3.72   0.000     339.1967    1095.927
 PIyrsusa2_3 |    557.857   115.3909     4.83   0.000     331.6939      784.02
 PIyrsusa2_4 |   283.3182   113.9643     2.49   0.013     59.95123    506.6851
 PIyrsusa2_5 |   430.0398    155.307     2.77   0.006     125.6423    734.4373
         PC1 |   523.1756   163.4686     3.20   0.001     202.7815    843.5697
          C1 |  -660.1119   107.3251    -6.15   0.000    -870.4662   -449.7576
  Yyear_1910 |   1003.595   104.2759     9.62   0.000     799.2168    1207.973
  Yyear_1920 |   1915.978   150.9943    12.69   0.000     1620.033    2211.923
       _cons |  -16108.46   4677.108    -3.44   0.001    -25275.47   -6941.453
------------------------------------------------------------------------------

. /* Drop immigrants who arrive as children*/
. reg occscore_all age age2 age3 age4 I* P* Y* T* [pw=weight2] if (fb==0 | (age_immig>9 & age_immig<40)) & panel_flag==0
(sum of wgt is   2.0033e+05)
note: Panel omitted because of collinearity
note: PIyrsusa2_1 omitted because of collinearity
note: PIyrsusa2_2 omitted because of collinearity
note: PIyrsusa2_3 omitted because of collinearity
note: PIyrsusa2_4 omitted because of collinearity
note: PIyrsusa2_5 omitted because of collinearity
note: PC1 omitted because of collinearity

Linear regression                                      Number of obs =  200334
                                                       F( 26,200307) =  374.47
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0340
                                                       Root MSE      =  9865.7

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   2740.984   434.7019     6.31   0.000     1888.979    3592.989
        age2 |  -77.29837    19.4756    -3.97   0.000    -115.4701   -39.12667
        age3 |   .9400402   .3726628     2.52   0.012     .2096301     1.67045
        age4 |  -.0042841   .0025806    -1.66   0.097     -.009342    .0007738
  Iyrsusa2_1 |  -1288.046   144.4017    -8.92   0.000     -1571.07   -1005.022
  Iyrsusa2_2 |  -842.8705   149.4692    -5.64   0.000    -1135.826   -549.9146
  Iyrsusa2_3 |  -535.1717   135.4276    -3.95   0.000    -800.6066   -269.7368
  Iyrsusa2_4 |  -328.9983   147.9365    -2.22   0.026    -618.9502   -39.04634
  Iyrsusa2_5 |   71.42273   206.3695     0.35   0.729    -333.0566     475.902
       Panel |          0  (omitted)
 PIyrsusa2_1 |          0  (omitted)
 PIyrsusa2_2 |          0  (omitted)
 PIyrsusa2_3 |          0  (omitted)
 PIyrsusa2_4 |          0  (omitted)
 PIyrsusa2_5 |          0  (omitted)
         PC1 |          0  (omitted)
  Yyear_1910 |   819.2298   75.00335    10.92   0.000      672.225    966.2345
  Yyear_1920 |   1505.329   109.0244    13.81   0.000     1291.644    1719.015
   Tbpl1_400 |  -2040.258   322.8146    -6.32   0.000    -2672.967    -1407.55
   Tbpl1_401 |   -1592.53   273.5081    -5.82   0.000    -2128.599   -1056.461
   Tbpl1_404 |  -2312.316    259.404    -8.91   0.000    -2820.741   -1803.891
   Tbpl1_405 |  -920.9368   185.2066    -4.97   0.000    -1283.937   -557.9363
   Tbpl1_410 |   2074.876   201.0005    10.32   0.000      1680.92    2468.832
   Tbpl1_411 |   2522.537   321.9029     7.84   0.000     1891.615    3153.459
   Tbpl1_412 |   2416.678   595.3384     4.06   0.000     1249.829    3583.527
   Tbpl1_414 |   656.3069   157.7631     4.16   0.000     347.0952    965.5187
   Tbpl1_420 |  -1842.735   649.4422    -2.84   0.005    -3115.626   -569.8444
   Tbpl1_421 |    402.669   461.1027     0.87   0.383    -501.0811    1306.419
   Tbpl1_426 |  -2367.877   421.3268    -5.62   0.000    -3193.667   -1542.087
   Tbpl1_436 |  -3506.721   443.9806    -7.90   0.000    -4376.912    -2636.53
   Tbpl1_450 |   922.7933   179.0813     5.15   0.000     571.7984    1273.788
   Tbpl1_453 |   482.6461   156.1615     3.09   0.002     176.5733     788.719
   Tbpl1_465 |   3080.058   189.3314    16.27   0.000     2708.973    3451.143
       _cons |   -13207.9   3486.651    -3.79   0.000    -20041.65    -6374.15
------------------------------------------------------------------------------

. reg occscore_all age age2 age3 age4 I* P* Y* C1 T* [pw=weight2] if (fb==0 | (age_immig>9 & age_immig<40))
(sum of wgt is   2.4211e+05)

Linear regression                                      Number of obs =  243671
                                                       F( 34,243636) =  206.93
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0340
                                                       Root MSE      =  9888.2

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   3402.262   601.4061     5.66   0.000     2223.522    4581.002
        age2 |  -105.7445   26.85492    -3.94   0.000    -158.3795   -53.10961
        age3 |   1.450235   .5118065     2.83   0.005     .4471077    2.453362
        age4 |  -.0075923   .0035288    -2.15   0.031    -.0145086   -.0006759
  Iyrsusa2_1 |  -522.2939   192.5037    -2.71   0.007    -899.5961   -144.9916
  Iyrsusa2_2 |   -201.998   178.7994    -1.13   0.259    -552.4401     148.444
  Iyrsusa2_3 |  -30.37881   146.1237    -0.21   0.835    -316.7775    256.0199
  Iyrsusa2_4 |   88.91295   151.2043     0.59   0.557    -207.4435    385.2694
  Iyrsusa2_5 |   188.5863   203.8777     0.92   0.355    -211.0086    588.1812
       Panel |  -153.5984   176.1388    -0.87   0.383    -498.8258     191.629
 PIyrsusa2_1 |   115.6552   245.3165     0.47   0.637    -365.1587    596.4692
 PIyrsusa2_2 |   170.8682   222.9245     0.77   0.443    -266.0579    607.7944
 PIyrsusa2_3 |   42.86103   167.3979     0.26   0.798    -285.2345    370.9566
 PIyrsusa2_4 |  -174.5923    169.815    -1.03   0.304    -507.4252    158.2407
 PIyrsusa2_5 |   183.6124   221.5467     0.83   0.407    -250.6134    617.8381
         PC1 |   567.8922   172.8649     3.29   0.001     229.0815    906.7029
  Yyear_1910 |   963.7715   107.4775     8.97   0.000     753.1184    1174.425
  Yyear_1920 |   1872.491   156.8514    11.94   0.000     1565.067    2179.916
          C1 |  -671.5999   114.1517    -5.88   0.000    -895.3341   -447.8656
   Tbpl1_400 |  -2082.398   253.7293    -8.21   0.000      -2579.7   -1585.095
   Tbpl1_401 |  -1964.762   224.2536    -8.76   0.000    -2404.293   -1525.231
   Tbpl1_404 |  -2638.261    220.646   -11.96   0.000    -3070.721   -2205.801
   Tbpl1_405 |  -1027.697   160.9639    -6.38   0.000    -1343.182   -712.2117
   Tbpl1_410 |   1933.485   174.7771    11.06   0.000     1590.927    2276.044
   Tbpl1_411 |   2400.084   266.8408     8.99   0.000     1877.083    2923.085
   Tbpl1_412 |   2037.328   465.2634     4.38   0.000     1125.424    2949.232
   Tbpl1_414 |   591.9831   138.5311     4.27   0.000     320.4659    863.5004
   Tbpl1_420 |  -1783.815   509.7714    -3.50   0.000    -2782.953   -784.6764
   Tbpl1_421 |   440.6409   353.8231     1.25   0.213    -252.8431    1134.125
   Tbpl1_426 |  -2420.941   326.1529    -7.42   0.000    -3060.192    -1781.69
   Tbpl1_436 |  -3777.086   349.0156   -10.82   0.000    -4461.147   -3093.025
   Tbpl1_450 |   801.8693   158.3463     5.06   0.000     491.5147    1112.224
   Tbpl1_453 |   307.6424   136.8527     2.25   0.025     39.41479    575.8701
   Tbpl1_465 |   3120.048   163.8734    19.04   0.000      2798.86    3441.235
       _cons |  -18593.85    4833.86    -3.85   0.000    -28068.09   -9119.613
------------------------------------------------------------------------------

. reg occscore_all age age2 age3 age4 I* P* Y* C1 T* [pw=weight2] if (fb==0 | (age_immig>11 & age_immig<40))
(sum of wgt is   2.3981e+05)

Linear regression                                      Number of obs =  238609
                                                       F( 34,238574) =  201.75
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0338
                                                       Root MSE      =  9901.2

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |    3441.76   607.7363     5.66   0.000     2250.613    4632.907
        age2 |  -107.0211   27.13288    -3.94   0.000    -160.2008   -53.84133
        age3 |   1.467846    .517006     2.84   0.005     .4545274    2.481164
        age4 |  -.0076794   .0035641    -2.15   0.031    -.0146648   -.0006939
  Iyrsusa2_1 |  -516.4881   195.9761    -2.64   0.008    -900.5962     -132.38
  Iyrsusa2_2 |  -292.2707   184.0628    -1.59   0.112     -653.029     68.4876
  Iyrsusa2_3 |  -50.57793   152.2799    -0.33   0.740    -349.0425    247.8866
  Iyrsusa2_4 |   130.5204   157.6727     0.83   0.408     -178.514    439.5549
  Iyrsusa2_5 |   145.0108   213.5987     0.68   0.497    -273.6372    563.6587
       Panel |  -153.4673   176.1388    -0.87   0.384    -498.6948    191.7601
 PIyrsusa2_1 |   96.44498   249.1551     0.39   0.699    -391.8924    584.7824
 PIyrsusa2_2 |   69.35154   229.1769     0.30   0.762    -379.8291    518.5322
 PIyrsusa2_3 |  -7.959901   174.8034    -0.05   0.964      -350.57    334.6502
 PIyrsusa2_4 |  -140.1208   179.1328    -0.78   0.434    -491.2163    210.9747
 PIyrsusa2_5 |   162.7515   235.8574     0.69   0.490    -299.5229    625.0258
         PC1 |   603.5452   179.1145     3.37   0.001     252.4853     954.605
  Yyear_1910 |   952.8576   108.4277     8.79   0.000     740.3422    1165.373
  Yyear_1920 |   1860.386   158.4747    11.74   0.000     1549.779    2170.992
          C1 |  -678.3387   117.8915    -5.75   0.000     -909.403   -447.2745
   Tbpl1_400 |   -2030.56   260.8212    -7.79   0.000    -2541.763   -1519.357
   Tbpl1_401 |  -1898.425   227.3115    -8.35   0.000     -2343.95   -1452.901
   Tbpl1_404 |  -2597.952   226.8318   -11.45   0.000    -3042.536   -2153.367
   Tbpl1_405 |   -982.954    165.032    -5.96   0.000    -1306.413   -659.4956
   Tbpl1_410 |   1855.673    182.025    10.19   0.000     1498.909    2212.437
   Tbpl1_411 |   2361.092   282.2543     8.37   0.000     1807.881    2914.303
   Tbpl1_412 |   1885.286   486.6527     3.87   0.000     931.4594    2839.112
   Tbpl1_414 |   546.8361   141.9052     3.85   0.000     268.7056    824.9666
   Tbpl1_420 |  -1947.257    526.725    -3.70   0.000    -2979.624   -914.8899
   Tbpl1_421 |   474.0788   364.7549     1.30   0.194    -240.8312    1188.989
   Tbpl1_426 |  -2472.227   326.7779    -7.57   0.000    -3112.703    -1831.75
   Tbpl1_436 |  -3934.764   349.3902   -11.26   0.000     -4619.56   -3249.968
   Tbpl1_450 |   840.4402   161.5054     5.20   0.000     523.8938    1156.987
   Tbpl1_453 |   375.1339   141.7566     2.65   0.008     97.29457    652.9732
   Tbpl1_465 |   3060.714   167.8809    18.23   0.000     2731.671    3389.756
       _cons |  -19022.93   4885.355    -3.89   0.000     -28598.1   -9447.758
------------------------------------------------------------------------------

. /* Finer arrival cohorts*/
. gen Coha=(yrimmig>=1886 & yrimmig<=1890)

. gen Cohb=(yrimmig>=1891 & yrimmig<=1895)

. gen Cohc=(yrimmig>=1896 & yrimmig<=1900)

. gen Coha_Panel=Coha*panel_flag

. gen Cohb_Panel=Cohb*panel_flag

. gen Cohc_Panel=Cohc*panel_flag

. replace Coha=0 if panel_flag==1
(17144 real changes made)

. replace Cohb=0 if panel_flag==1
(12297 real changes made)

. replace Cohc=0 if panel_flag==1
(5836 real changes made)

. reg occscore_all age age2 age3 age4 I* PI* Y* T* Coha-Cohc Coha_Panel-Cohc_Panel Panel [pw=weight2]
(sum of wgt is   2.4882e+05)

Linear regression                                      Number of obs =  259093
                                                       F( 38,259054) =  203.26
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0349
                                                       Root MSE      =  9853.1

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   3122.307    582.614     5.36   0.000     1980.399    4264.214
        age2 |  -94.66008   26.06581    -3.63   0.000    -145.7484   -43.57179
        age3 |   1.259128   .4976717     2.53   0.011     .2837045    2.234551
        age4 |   -.006379   .0034371    -1.86   0.063    -.0131157    .0003576
  Iyrsusa2_1 |  -56.53692   219.5133    -0.26   0.797    -486.7771    373.7033
  Iyrsusa2_2 |    11.5608   196.9985     0.06   0.953     -374.551    397.6726
  Iyrsusa2_3 |   250.9111   155.9439     1.61   0.108    -54.73475    556.5569
  Iyrsusa2_4 |     176.77    157.537     1.12   0.262    -131.9983    485.5383
  Iyrsusa2_5 |   211.3704   187.1404     1.13   0.259    -155.4198    578.1606
 PIyrsusa2_1 |   579.9207   275.9471     2.10   0.036     39.07181    1120.769
 PIyrsusa2_2 |    391.357   239.1256     1.64   0.102     -77.3228    860.0367
 PIyrsusa2_3 |   364.7615   173.9753     2.10   0.036     23.77453    705.7485
 PIyrsusa2_4 |   93.22195   170.6712     0.55   0.585     -241.289    427.7329
 PIyrsusa2_5 |   260.0435   196.9427     1.32   0.187    -125.9589    646.0459
  Yyear_1910 |   985.5368   104.8376     9.40   0.000     780.0579    1191.016
  Yyear_1920 |   1906.667   152.0015    12.54   0.000     1608.748    2204.586
   Tbpl1_400 |  -2400.793   238.0346   -10.09   0.000    -2867.334   -1934.251
   Tbpl1_401 |  -2206.877   218.3828   -10.11   0.000    -2634.902   -1778.853
   Tbpl1_404 |  -2833.415   203.8136   -13.90   0.000    -3232.884   -2433.946
   Tbpl1_405 |  -1271.912   154.2797    -8.24   0.000    -1574.296   -969.5281
   Tbpl1_410 |    1865.25   159.7473    11.68   0.000      1552.15    2178.351
   Tbpl1_411 |   2379.965   234.1645    10.16   0.000     1921.009    2838.921
   Tbpl1_412 |   1843.352   370.4666     4.98   0.000     1117.248    2569.457
   Tbpl1_414 |   500.3833   132.9644     3.76   0.000     239.7768    760.9899
   Tbpl1_420 |  -1937.417   445.1912    -4.35   0.000     -2809.98   -1064.854
   Tbpl1_421 |   424.3008   325.8775     1.30   0.193    -214.4103    1063.012
   Tbpl1_426 |  -2246.749   310.3717    -7.24   0.000    -2855.069   -1638.429
   Tbpl1_436 |  -3814.938   326.1624   -11.70   0.000    -4454.207   -3175.668
   Tbpl1_450 |   599.9127   155.0629     3.87   0.000     295.9937    903.8318
   Tbpl1_453 |   59.62127    129.388     0.46   0.645    -193.9757    313.2183
   Tbpl1_465 |   3065.256   159.0433    19.27   0.000     2753.536    3376.977
        Coha |   8.612655    122.185     0.07   0.944    -230.8667     248.092
        Cohb |  -503.4634   141.6709    -3.55   0.000    -781.1346   -225.7923
        Cohc |  -1134.503   157.8786    -7.19   0.000    -1443.941   -825.0651
  Coha_Panel |   71.99301   143.5056     0.50   0.616    -209.2741    353.2601
  Cohb_Panel |  -12.92597   168.9913    -0.08   0.939    -344.1444    318.2924
  Cohc_Panel |  -586.9039   206.6474    -2.84   0.005    -991.9272   -181.8806
       Panel |  -154.0934    176.141    -0.87   0.382     -499.325    191.1381
       _cons |  -16030.65   4673.446    -3.43   0.001    -25190.48   -6870.816
------------------------------------------------------------------------------

. /* Ln(occscore)*/
. replace lnoccscore=ln(occscore_all) if lnoccscore==.
(0 real changes made)

. reg lnoccscore age age2 age3 age4 I* P* Y* T* [pw=weight2] if panel_flag==0
(sum of wgt is   2.0546e+05)
note: Panel omitted because of collinearity
note: PIyrsusa2_1 omitted because of collinearity
note: PIyrsusa2_2 omitted because of collinearity
note: PIyrsusa2_3 omitted because of collinearity
note: PIyrsusa2_4 omitted because of collinearity
note: PIyrsusa2_5 omitted because of collinearity
note: PC1 omitted because of collinearity

Linear regression                                      Number of obs =  205458
                                                       F( 25,205431) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0421
                                                       Root MSE      =   .4585

------------------------------------------------------------------------------
             |               Robust
  lnoccscore |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .1563949   .0212386     7.36   0.000     .1147677     .198022
        age2 |  -.0045717   .0009393    -4.87   0.000    -.0064128   -.0027306
        age3 |   .0000584   .0000178     3.28   0.001     .0000235    .0000932
        age4 |  -2.82e-07   1.22e-07    -2.31   0.021    -5.21e-07   -4.25e-08
  Iyrsusa2_1 |   .0058798   .0077724     0.76   0.449     -.009354    .0211136
  Iyrsusa2_2 |   .0284497   .0070327     4.05   0.000     .0146658    .0422336
  Iyrsusa2_3 |   .0412785   .0059609     6.92   0.000     .0295954    .0529617
  Iyrsusa2_4 |   .0343166   .0064272     5.34   0.000     .0217193    .0469138
  Iyrsusa2_5 |   .0414635   .0082992     5.00   0.000     .0251972    .0577298
       Panel |          0  (omitted)
 PIyrsusa2_1 |          0  (omitted)
 PIyrsusa2_2 |          0  (omitted)
 PIyrsusa2_3 |          0  (omitted)
 PIyrsusa2_4 |          0  (omitted)
 PIyrsusa2_5 |          0  (omitted)
         PC1 |          0  (omitted)
  Yyear_1910 |   .0299485   .0034529     8.67   0.000     .0231809    .0367162
  Yyear_1920 |   .0674077   .0048553    13.88   0.000     .0578915    .0769239
   Tbpl1_400 |  -.1545237   .0153805   -10.05   0.000    -.1846692   -.1243782
   Tbpl1_401 |  -.0821206   .0145483    -5.64   0.000    -.1106349   -.0536063
   Tbpl1_404 |  -.1629671   .0119995   -13.58   0.000    -.1864858   -.1394484
   Tbpl1_405 |  -.0766837   .0087503    -8.76   0.000     -.093834   -.0595334
   Tbpl1_410 |    .084421   .0085069     9.92   0.000     .0677476    .1010944
   Tbpl1_411 |   .1117521    .012605     8.87   0.000     .0870467    .1364576
   Tbpl1_412 |   .0990267   .0215171     4.60   0.000     .0568538    .1411996
   Tbpl1_414 |   .0296207     .00713     4.15   0.000     .0156462    .0435953
   Tbpl1_420 |  -.1131049    .028545    -3.96   0.000    -.1690524   -.0571574
   Tbpl1_421 |  -.0097366   .0200969    -0.48   0.628     -.049126    .0296528
   Tbpl1_426 |   -.151603   .0201333    -7.53   0.000    -.1910637   -.1121423
   Tbpl1_436 |  -.1934171   .0229923    -8.41   0.000    -.2384814   -.1483529
   Tbpl1_450 |   .0377232    .008101     4.66   0.000     .0218454    .0536009
   Tbpl1_453 |  -.0109566    .006872    -1.59   0.111    -.0244254    .0025123
   Tbpl1_465 |   .1185282   .0080279    14.76   0.000     .1027936    .1342627
       _cons |   7.938318    .173038    45.88   0.000     7.599168    8.277469
------------------------------------------------------------------------------

. reg lnoccscore age age2 age3 age4 I* P* Y* C1 T* [pw=weight2]
(sum of wgt is   2.4882e+05)

Linear regression                                      Number of obs =  259093
                                                       F( 33,259058) =       .
                                                       Prob > F      =       .
                                                       R-squared     =  0.0433
                                                       Root MSE      =  .45611

------------------------------------------------------------------------------
             |               Robust
  lnoccscore |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   .1793893   .0282458     6.35   0.000     .1240283    .2347502
        age2 |  -.0055451   .0012461    -4.45   0.000    -.0079875   -.0031027
        age3 |   .0000754   .0000235     3.20   0.001     .0000293    .0001215
        age4 |  -3.89e-07   1.61e-07    -2.41   0.016    -7.04e-07   -7.29e-08
  Iyrsusa2_1 |   .0468988   .0096093     4.88   0.000     .0280649    .0657327
  Iyrsusa2_2 |    .062571   .0081159     7.71   0.000     .0466641    .0784779
  Iyrsusa2_3 |   .0654906   .0062242    10.52   0.000     .0532914    .0776898
  Iyrsusa2_4 |   .0531106   .0063216     8.40   0.000     .0407205    .0655007
  Iyrsusa2_5 |   .0460843   .0080111     5.75   0.000     .0303828    .0617859
       Panel |  -.0050034   .0078415    -0.64   0.523    -.0203726    .0103657
 PIyrsusa2_1 |   .0842591   .0120331     7.00   0.000     .0606745    .1078436
 PIyrsusa2_2 |   .0825226   .0101821     8.10   0.000     .0625659    .1024792
 PIyrsusa2_3 |   .0704216   .0070754     9.95   0.000      .056554    .0842893
 PIyrsusa2_4 |   .0590366   .0068166     8.66   0.000     .0456762     .072397
 PIyrsusa2_5 |   .0608302    .008201     7.42   0.000     .0447564    .0769039
         PC1 |   .0250398   .0073957     3.39   0.001     .0105444    .0395352
  Yyear_1910 |   .0374904    .004717     7.95   0.000     .0282452    .0467356
  Yyear_1920 |   .0849707   .0066306    12.81   0.000      .071975    .0979665
          C1 |  -.0337871   .0049903    -6.77   0.000    -.0435678   -.0240063
   Tbpl1_400 |   -.156842   .0119683   -13.10   0.000    -.1802995   -.1333844
   Tbpl1_401 |  -.1041876   .0118592    -8.79   0.000    -.1274313    -.080944
   Tbpl1_404 |  -.1787523   .0102166   -17.50   0.000    -.1987766   -.1587279
   Tbpl1_405 |  -.0838602   .0074953   -11.19   0.000    -.0985508   -.0691697
   Tbpl1_410 |   .0759722   .0073089    10.39   0.000     .0616469    .0902975
   Tbpl1_411 |    .103104   .0102182    10.09   0.000     .0830766    .1231313
   Tbpl1_412 |   .0814057   .0168056     4.84   0.000     .0484672    .1143442
   Tbpl1_414 |    .024946   .0061529     4.05   0.000     .0128865    .0370056
   Tbpl1_420 |  -.1109635   .0221041    -5.02   0.000     -.154287     -.06764
   Tbpl1_421 |  -.0106308   .0152805    -0.70   0.487    -.0405802    .0193185
   Tbpl1_426 |   -.156009   .0154429   -10.10   0.000    -.1862767   -.1257413
   Tbpl1_436 |  -.2112735   .0176395   -11.98   0.000    -.2458465   -.1767005
   Tbpl1_450 |   .0308241   .0070899     4.35   0.000      .016928    .0447202
   Tbpl1_453 |  -.0204753   .0059362    -3.45   0.001    -.0321101   -.0088405
   Tbpl1_465 |   .1163426   .0068519    16.98   0.000     .1029131    .1297722
       _cons |   7.748192   .2305706    33.60   0.000      7.29628    8.200104
------------------------------------------------------------------------------

. 
. /* Table 5: State fixed effects*/
. xi, pref(S) i.stateicp
i.stateicp        Sstateicp_1-99      (naturally coded; Sstateicp_1 omitted)

. reg occscore_all age age2 age3 age4 I* P*  T* Y* S* [pw=weight2] if stateicp!=. & panel_flag==0
(sum of wgt is   1.9438e+05)
note: Panel omitted because of collinearity
note: PIyrsusa2_1 omitted because of collinearity
note: PIyrsusa2_2 omitted because of collinearity
note: PIyrsusa2_3 omitted because of collinearity
note: PIyrsusa2_4 omitted because of collinearity
note: PIyrsusa2_5 omitted because of collinearity
note: PC1 omitted because of collinearity
note: Sstateicp_97 omitted because of collinearity
note: Sstateicp_98 omitted because of collinearity
note: Sstateicp_99 omitted because of collinearity

Linear regression                                      Number of obs =  194383
                                                       F( 75,194307) =  212.26
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0609
                                                       Root MSE      =  9674.2

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   2867.839   428.9425     6.69   0.000     2027.122    3708.557
        age2 |  -84.17363   19.26224    -4.37   0.000    -121.9272   -46.42009
        age3 |   1.083401   .3693211     2.93   0.003     .3595404    1.807262
        age4 |  -.0053218    .002562    -2.08   0.038    -.0103432   -.0003004
  Iyrsusa2_1 |  -2679.417   154.5743   -17.33   0.000    -2982.379   -2376.455
  Iyrsusa2_2 |  -2125.786   158.6422   -13.40   0.000    -2436.721   -1814.851
  Iyrsusa2_3 |  -1662.499   141.9924   -11.71   0.000      -1940.8   -1384.197
  Iyrsusa2_4 |  -1473.554   153.4883    -9.60   0.000    -1774.387    -1172.72
  Iyrsusa2_5 |   -1059.34   195.5225    -5.42   0.000    -1442.559   -676.1204
       Panel |          0  (omitted)
 PIyrsusa2_1 |          0  (omitted)
 PIyrsusa2_2 |          0  (omitted)
 PIyrsusa2_3 |          0  (omitted)
 PIyrsusa2_4 |          0  (omitted)
 PIyrsusa2_5 |          0  (omitted)
         PC1 |          0  (omitted)
   Tbpl1_400 |  -339.2851   309.5544    -1.10   0.273    -946.0043     267.434
   Tbpl1_401 |  -52.79751   276.8637    -0.19   0.849    -595.4439    489.8488
   Tbpl1_404 |   262.5699   250.3247     1.05   0.294    -228.0606    753.2003
   Tbpl1_405 |   591.7213    187.831     3.15   0.002     223.5769    959.8657
   Tbpl1_410 |   2716.789    194.363    13.98   0.000     2335.843    3097.736
   Tbpl1_411 |   3131.053   303.6241    10.31   0.000     2535.957    3726.149
   Tbpl1_412 |   3360.091   482.8421     6.96   0.000     2413.732     4306.45
   Tbpl1_414 |   631.6145   168.4521     3.75   0.000     301.4523    961.7766
   Tbpl1_420 |  -692.3398   572.7168    -1.21   0.227    -1814.851    430.1715
   Tbpl1_421 |   918.0272   455.8903     2.01   0.044     24.49299    1811.561
   Tbpl1_426 |  -784.4293   420.2719    -1.87   0.062    -1608.152    39.29356
   Tbpl1_436 |  -4000.366   422.1037    -9.48   0.000    -4827.679   -3173.053
   Tbpl1_450 |   1019.559   188.8473     5.40   0.000     649.4232    1389.696
   Tbpl1_453 |   1431.602    157.848     9.07   0.000     1122.224     1740.98
   Tbpl1_465 |   3151.698   206.0422    15.30   0.000      2747.86    3555.536
  Yyear_1910 |   781.0254   75.06602    10.40   0.000     633.8977     928.153
  Yyear_1920 |   1475.471   108.7047    13.57   0.000     1262.412     1688.53
 Sstateicp_2 |  -3120.041     260.79   -11.96   0.000    -3631.183   -2608.899
 Sstateicp_3 |   517.8266   178.7141     2.90   0.004     167.5513    868.1019
 Sstateicp_4 |  -2346.291   306.9663    -7.64   0.000    -2947.938   -1744.645
 Sstateicp_5 |  -11.47851    268.709    -0.04   0.966    -538.1417    515.1847
 Sstateicp_6 |    -4423.1   337.8341   -13.09   0.000    -5085.247   -3760.953
Sstateicp_11 |  -1256.012   1347.602    -0.93   0.351     -3897.28    1385.256
Sstateicp_12 |   589.3568   184.9262     3.19   0.001     226.9059    951.8078
Sstateicp_13 |  -508.5496   168.8109    -3.01   0.003     -839.415   -177.6841
Sstateicp_14 |  -710.7066   165.1874    -4.30   0.000     -1034.47   -386.9433
Sstateicp_21 |  -1663.731   171.8114    -9.68   0.000    -2000.477   -1326.985
Sstateicp_22 |  -3283.497   187.1963   -17.54   0.000    -3650.398   -2916.597
Sstateicp_23 |  -2926.154    187.984   -15.57   0.000    -3294.598    -2557.71
Sstateicp_24 |  -1882.959   172.9047   -10.89   0.000    -2221.848    -1544.07
Sstateicp_25 |  -3674.009   194.9547   -18.85   0.000    -4056.115   -3291.902
Sstateicp_31 |  -4356.974   196.2213   -22.20   0.000    -4741.564   -3972.385
Sstateicp_32 |  -4970.696   205.7056   -24.16   0.000    -5373.875   -4567.518
Sstateicp_33 |  -3640.367   198.1319   -18.37   0.000      -4028.7   -3252.033
Sstateicp_34 |  -3809.702   180.9336   -21.06   0.000    -4164.328   -3455.077
Sstateicp_35 |  -4676.846   225.8672   -20.71   0.000    -5119.541   -4234.152
Sstateicp_36 |  -6215.115   312.1812   -19.91   0.000    -6826.983   -5603.248
Sstateicp_37 |  -5854.716   291.1524   -20.11   0.000    -6425.368   -5284.065
Sstateicp_40 |  -268.6195   963.8323    -0.28   0.780    -2157.708    1620.469
Sstateicp_41 |   783.4703   1359.326     0.58   0.564    -1880.776    3447.716
Sstateicp_42 |   -2544.24   1292.023    -1.97   0.049    -5076.574   -11.90528
Sstateicp_43 |   508.1597   1223.345     0.42   0.678    -1889.567    2905.887
Sstateicp_44 |   2707.739   1294.891     2.09   0.037     169.7832    5245.695
Sstateicp_45 |  -1633.845   741.8224    -2.20   0.028      -3087.8    -179.891
Sstateicp_46 |   2519.011   1762.679     1.43   0.153    -935.7977    5973.819
Sstateicp_47 |   160.3232   3336.552     0.05   0.962    -6379.239    6699.885
Sstateicp_48 |   2258.855   1952.998     1.16   0.247    -1568.975    6086.685
Sstateicp_49 |  -4350.155   502.0821    -8.66   0.000    -5334.224   -3366.086
Sstateicp_51 |   330.6147   1044.516     0.32   0.752    -1716.611    2377.841
Sstateicp_52 |   843.3237   519.5315     1.62   0.105    -174.9457    1861.593
Sstateicp_53 |  -6224.229   1372.906    -4.53   0.000    -8915.092   -3533.367
Sstateicp_54 |   564.5871   1263.143     0.45   0.655    -1911.144    3040.318
Sstateicp_56 |   178.3184   839.6033     0.21   0.832    -1467.284    1823.921
Sstateicp_61 |  -2124.434   446.8319    -4.75   0.000    -3000.214   -1248.654
Sstateicp_62 |  -2825.867   260.3564   -10.85   0.000    -3336.159   -2315.574
Sstateicp_63 |  -4796.155   362.6622   -13.22   0.000    -5506.965   -4085.346
Sstateicp_64 |  -3597.806   314.2511   -11.45   0.000    -4213.731   -2981.881
Sstateicp_65 |  -1380.685   642.1776    -2.15   0.032    -2639.338   -122.0325
Sstateicp_66 |  -5710.848   416.2894   -13.72   0.000    -6526.766   -4894.931
Sstateicp_67 |  -2706.818    367.549    -7.36   0.000    -3427.205   -1986.431
Sstateicp_68 |  -3908.176   440.3284    -8.88   0.000    -4771.209   -3045.143
Sstateicp_71 |   -958.176   192.8124    -4.97   0.000    -1336.084   -580.2684
Sstateicp_72 |  -3089.799   264.2829   -11.69   0.000    -3607.787   -2571.811
Sstateicp_73 |  -1937.266   228.3578    -8.48   0.000    -2384.842    -1489.69
Sstateicp_81 |  -2536.791   733.9724    -3.46   0.001     -3975.36   -1098.223
Sstateicp_82 |  -726.3811   802.9747    -0.90   0.366    -2300.192    847.4302
Sstateicp_97 |          0  (omitted)
Sstateicp_98 |          0  (omitted)
Sstateicp_99 |          0  (omitted)
       _cons |  -11796.77   3436.329    -3.43   0.001    -18531.89   -5061.643
------------------------------------------------------------------------------

. reg occscore_all age age2 age3 age4 I* P* C1 T* Y* S* [pw=weight2] if stateicp!=.
(sum of wgt is   2.3714e+05)
note: Sstateicp_97 omitted because of collinearity

Linear regression                                      Number of obs =  247378
                                                       F( 85,247292) =  135.23
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0651
                                                       Root MSE      =  9673.7

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   3496.371   586.9947     5.96   0.000     2345.877    4646.865
        age2 |  -110.8636   26.28406    -4.22   0.000    -162.3796   -59.34752
        age3 |   1.554345   .5021419     3.10   0.002     .5701604     2.53853
        age4 |  -.0083168   .0034696    -2.40   0.017     -.015117   -.0015165
  Iyrsusa2_1 |  -1696.024   198.4327    -8.55   0.000    -2084.946   -1307.101
  Iyrsusa2_2 |   -1323.73   182.9069    -7.24   0.000    -1682.223   -965.2374
  Iyrsusa2_3 |   -1123.49   143.2303    -7.84   0.000    -1404.218   -842.7624
  Iyrsusa2_4 |   -1045.93    149.282    -7.01   0.000    -1338.519   -753.3414
  Iyrsusa2_5 |  -955.8133   187.7152    -5.09   0.000     -1323.73   -587.8964
       Panel |  -156.5163   172.0942    -0.91   0.363    -493.8165    180.7838
 PIyrsusa2_1 |  -955.4486   242.2853    -3.94   0.000    -1430.321   -480.5759
 PIyrsusa2_2 |  -817.1379   216.2823    -3.78   0.000    -1241.045   -393.2304
 PIyrsusa2_3 |  -802.0105    155.946    -5.14   0.000    -1107.661   -496.3604
 PIyrsusa2_4 |  -1024.759   155.9176    -6.57   0.000    -1330.353   -719.1644
 PIyrsusa2_5 |  -804.7742    189.558    -4.25   0.000    -1176.303   -433.2455
         PC1 |   608.2603   161.9725     3.76   0.000     290.7986    925.7221
          C1 |  -907.0886   110.9407    -8.18   0.000    -1124.529   -689.6478
   Tbpl1_400 |  -256.7496   242.6564    -1.06   0.290    -732.3498    218.8506
   Tbpl1_401 |  -244.8582   230.1536    -1.06   0.287    -695.9532    206.2367
   Tbpl1_404 |   68.91543   218.0507     0.32   0.752    -358.4581     496.289
   Tbpl1_405 |   520.8291   163.6849     3.18   0.001     200.0109    841.6472
   Tbpl1_410 |   2424.872   166.1626    14.59   0.000     2099.197    2750.546
   Tbpl1_411 |   2871.911   244.5304    11.74   0.000     2392.638    3351.184
   Tbpl1_412 |   2839.516   375.3027     7.57   0.000     2103.933    3575.099
   Tbpl1_414 |   461.8733   143.6617     3.22   0.001     180.3002    743.4463
   Tbpl1_420 |  -559.2267    439.283    -1.27   0.203     -1420.21    301.7564
   Tbpl1_421 |   933.4472   338.5685     2.76   0.006     269.8619    1597.033
   Tbpl1_426 |    -969.01   319.0814    -3.04   0.002    -1594.401   -343.6189
   Tbpl1_436 |  -4457.225   338.0392   -13.19   0.000    -5119.773   -3794.677
   Tbpl1_450 |   932.2198   164.7559     5.66   0.000     609.3026    1255.137
   Tbpl1_453 |   1230.763   136.1963     9.04   0.000     963.8216    1497.704
   Tbpl1_465 |   3251.681   170.8578    19.03   0.000     2916.804    3586.558
  Yyear_1910 |   937.0628   105.1069     8.92   0.000     731.0561     1143.07
  Yyear_1920 |   1837.143   151.7669    12.11   0.000     1539.684    2134.602
 Sstateicp_2 |  -2940.275   355.6392    -8.27   0.000    -3637.318   -2243.231
 Sstateicp_3 |   951.0838    257.804     3.69   0.000     445.7947    1456.373
 Sstateicp_4 |  -1595.137   520.4545    -3.06   0.002    -2615.214   -575.0598
 Sstateicp_5 |   507.4745   355.8262     1.43   0.154    -189.9354    1204.884
 Sstateicp_6 |  -4450.208   501.6868    -8.87   0.000    -5433.501   -3466.915
Sstateicp_11 |   746.5549   1362.901     0.55   0.584    -1924.696    3417.806
Sstateicp_12 |   797.2322   248.4591     3.21   0.001      310.259    1284.205
Sstateicp_13 |  -60.00759   242.9003    -0.25   0.805    -536.0857    416.0705
Sstateicp_14 |  -294.4392   237.5189    -1.24   0.215      -759.97    171.0916
Sstateicp_21 |  -1467.361   244.7625    -6.00   0.000    -1947.089   -987.6329
Sstateicp_22 |  -3028.847    260.706   -11.62   0.000    -3539.824    -2517.87
Sstateicp_23 |  -2998.092   260.3732   -11.51   0.000    -3508.417   -2487.768
Sstateicp_24 |   -1573.79   246.4153    -6.39   0.000    -2056.757   -1090.822
Sstateicp_25 |  -3463.618   280.2781   -12.36   0.000    -4012.956    -2914.28
Sstateicp_31 |  -4417.169   266.8845   -16.55   0.000    -4940.256   -3894.083
Sstateicp_32 |  -5059.506   287.3403   -17.61   0.000    -5622.686   -4496.327
Sstateicp_33 |  -3491.487   283.1292   -12.33   0.000    -4046.412   -2936.561
Sstateicp_34 |  -3488.018   262.6285   -13.28   0.000    -4002.763   -2973.273
Sstateicp_35 |   -4626.41   312.4174   -14.81   0.000    -5238.739    -4014.08
Sstateicp_36 |  -6678.664   341.9522   -19.53   0.000    -7348.881   -6008.446
Sstateicp_37 |  -5991.997   411.7814   -14.55   0.000    -6799.078   -5184.916
Sstateicp_40 |   810.1032   953.2365     0.85   0.395    -1058.215    2678.421
Sstateicp_41 |   1044.506   1038.702     1.01   0.315    -991.3228    3080.334
Sstateicp_42 |  -1353.685   3095.072    -0.44   0.662    -7419.945    4712.575
Sstateicp_43 |   2612.351    1654.89     1.58   0.114    -631.1888    5855.891
Sstateicp_44 |   5446.205   1757.117     3.10   0.002     2002.302    8890.108
Sstateicp_45 |  -1084.493   665.6951    -1.63   0.103    -2389.238    220.2513
Sstateicp_46 |  -1507.351   3598.552    -0.42   0.675    -8560.417    5545.716
Sstateicp_47 |  -4115.696   2427.456    -1.70   0.090    -8873.445    642.0527
Sstateicp_48 |   2875.467   1728.092     1.66   0.096    -511.5473    6262.482
Sstateicp_49 |  -3877.342    776.844    -4.99   0.000    -5399.936   -2354.749
Sstateicp_51 |   1464.747   923.9157     1.59   0.113    -346.1035    3275.597
Sstateicp_52 |   1341.107   734.8541     1.82   0.068    -99.18786    2781.401
Sstateicp_53 |  -2199.478   2022.026    -1.09   0.277    -6162.596     1763.64
Sstateicp_54 |   823.8191   1178.618     0.70   0.485     -1486.24    3133.878
Sstateicp_56 |  -301.5953   887.6329    -0.34   0.734    -2041.332    1438.142
Sstateicp_61 |  -1449.054   536.7268    -2.70   0.007    -2501.024   -397.0834
Sstateicp_62 |  -2724.145    330.147    -8.25   0.000    -3371.224   -2077.065
Sstateicp_63 |  -4821.968   548.4063    -8.79   0.000     -5896.83   -3747.106
Sstateicp_64 |  -3459.202   381.1493    -9.08   0.000    -4206.245    -2712.16
Sstateicp_65 |  -1277.795   617.0321    -2.07   0.038    -2487.162   -68.42851
Sstateicp_66 |  -5168.128   445.0337   -11.61   0.000    -6040.382   -4295.873
Sstateicp_67 |  -2878.887   461.9778    -6.23   0.000    -3784.351   -1973.422
Sstateicp_68 |   -3443.86    457.396    -7.53   0.000    -4340.344   -2547.376
Sstateicp_71 |   -474.801   272.5376    -1.74   0.081    -1008.967    59.36545
Sstateicp_72 |  -2932.448   340.4082    -8.61   0.000    -3599.639   -2265.257
Sstateicp_73 |  -1681.726   302.5017    -5.56   0.000    -2274.622   -1088.831
Sstateicp_81 |   -2318.27   749.7475    -3.09   0.002    -3787.755   -848.7847
Sstateicp_82 |  -436.3791   820.2023    -0.53   0.595    -2043.954    1171.196
Sstateicp_97 |          0  (omitted)
Sstateicp_98 |  -3230.187   633.1609    -5.10   0.000    -4471.166   -1989.208
Sstateicp_99 |  -4636.596   1931.307    -2.40   0.016    -8421.907    -851.284
       _cons |  -17231.82   4707.912    -3.66   0.000    -26459.21   -8004.437
------------------------------------------------------------------------------

. /* Urban only*/
. *gen urban=(shurb1_1900>=.4 & shurb1_1900!=.)
. *replace urban=. if shurb1_1900==.
. reg occscore_all age age2 age3 age4 I* P* T* Y* [pw=weight2] if panel_flag==0 & urban==1
(sum of wgt is   1.1093e+05)
note: Panel omitted because of collinearity
note: PIyrsusa2_1 omitted because of collinearity
note: PIyrsusa2_2 omitted because of collinearity
note: PIyrsusa2_3 omitted because of collinearity
note: PIyrsusa2_4 omitted because of collinearity
note: PIyrsusa2_5 omitted because of collinearity
note: PC1 omitted because of collinearity

Linear regression                                      Number of obs =  110934
                                                       F( 26,110907) =  216.27
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0321
                                                       Root MSE      =  9263.3

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   2029.316   546.0203     3.72   0.000     959.1238    3099.508
        age2 |  -54.36876   24.49183    -2.22   0.026    -102.3724   -6.365136
        age3 |    .627565    .469136     1.34   0.181    -.2919347    1.547065
        age4 |  -.0027592   .0032517    -0.85   0.396    -.0091326    .0036141
  Iyrsusa2_1 |  -4209.723   179.8926   -23.40   0.000     -4562.31   -3857.137
  Iyrsusa2_2 |  -3450.401   180.6404   -19.10   0.000    -3804.453   -3096.348
  Iyrsusa2_3 |  -2752.166   161.1406   -17.08   0.000        -3068   -2436.333
  Iyrsusa2_4 |  -2329.786   173.9357   -13.39   0.000    -2670.697   -1988.874
  Iyrsusa2_5 |  -1867.163   224.7572    -8.31   0.000    -2307.684   -1426.642
       Panel |          0  (omitted)
 PIyrsusa2_1 |          0  (omitted)
 PIyrsusa2_2 |          0  (omitted)
 PIyrsusa2_3 |          0  (omitted)
 PIyrsusa2_4 |          0  (omitted)
 PIyrsusa2_5 |          0  (omitted)
         PC1 |          0  (omitted)
   Tbpl1_400 |   606.4741   412.9698     1.47   0.142    -202.9407    1415.889
   Tbpl1_401 |  -1026.932    368.106    -2.79   0.005    -1748.414   -305.4496
   Tbpl1_404 |   1127.092   334.1134     3.37   0.001     472.2345    1781.949
   Tbpl1_405 |   1110.588   218.5624     5.08   0.000     682.2085    1538.967
   Tbpl1_410 |   2804.118   216.4368    12.96   0.000     2379.905    3228.331
   Tbpl1_411 |   3308.838   329.7238    10.04   0.000     2662.585    3955.092
   Tbpl1_412 |   3090.739   542.1677     5.70   0.000     2028.099     4153.38
   Tbpl1_414 |   878.0149   180.9748     4.85   0.000      523.307    1232.723
   Tbpl1_420 |  -789.5904   640.3745    -1.23   0.218    -2044.715    465.5342
   Tbpl1_421 |    1035.66   546.9462     1.89   0.058    -36.34637    2107.667
   Tbpl1_426 |   778.6769   552.9478     1.41   0.159    -305.0927    1862.446
   Tbpl1_436 |  -2900.706   474.5854    -6.11   0.000    -3830.887   -1970.526
   Tbpl1_450 |   1186.152   212.6443     5.58   0.000      769.372    1602.931
   Tbpl1_453 |   2026.144   178.8513    11.33   0.000     1675.598     2376.69
   Tbpl1_465 |   3409.207   224.3976    15.19   0.000     2969.391    3849.023
  Yyear_1910 |   515.7374   95.28308     5.41   0.000     328.9839    702.4908
  Yyear_1920 |   1200.586   137.5447     8.73   0.000     931.0003    1470.172
       _cons |  -2710.282   4374.063    -0.62   0.536    -11283.38    5862.817
------------------------------------------------------------------------------

. reg occscore_all age age2 age3 age4 I* P* C1 T* Y* [pw=weight2] if urban==1
(sum of wgt is   1.1093e+05)
note: Panel omitted because of collinearity
note: PIyrsusa2_1 omitted because of collinearity
note: PIyrsusa2_2 omitted because of collinearity
note: PIyrsusa2_3 omitted because of collinearity
note: PIyrsusa2_4 omitted because of collinearity
note: PIyrsusa2_5 omitted because of collinearity
note: PC1 omitted because of collinearity

Linear regression                                      Number of obs =  110934
                                                       F( 27,110906) =  208.91
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0323
                                                       Root MSE      =  9262.2

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   2075.305   546.0011     3.80   0.000     1005.151    3145.459
        age2 |   -56.4648   24.49198    -2.31   0.021    -104.4687   -8.460873
        age3 |   .6651477   .4691367     1.42   0.156    -.2543535    1.584649
        age4 |  -.0029961   .0032517    -0.92   0.357    -.0093693    .0033771
  Iyrsusa2_1 |  -3328.364   230.6941   -14.43   0.000    -3780.521   -2876.207
  Iyrsusa2_2 |  -2734.787   216.6786   -12.62   0.000    -3159.474     -2310.1
  Iyrsusa2_3 |  -2264.686   178.6917   -12.67   0.000    -2614.919   -1914.453
  Iyrsusa2_4 |  -1953.544   184.6291   -10.58   0.000    -2315.414   -1591.673
  Iyrsusa2_5 |  -1759.987   224.8964    -7.83   0.000     -2200.78   -1319.193
       Panel |          0  (omitted)
 PIyrsusa2_1 |          0  (omitted)
 PIyrsusa2_2 |          0  (omitted)
 PIyrsusa2_3 |          0  (omitted)
 PIyrsusa2_4 |          0  (omitted)
 PIyrsusa2_5 |          0  (omitted)
         PC1 |          0  (omitted)
          C1 |  -757.8121   123.1814    -6.15   0.000    -999.2458   -516.3785
   Tbpl1_400 |   494.0617   413.6484     1.19   0.232    -316.6832    1304.807
   Tbpl1_401 |  -1068.354    366.927    -2.91   0.004    -1787.525   -349.1824
   Tbpl1_404 |   987.3195   334.3371     2.95   0.003     332.0237    1642.615
   Tbpl1_405 |   989.3375   219.1105     4.52   0.000     559.8842    1418.791
   Tbpl1_410 |   2607.381   218.3069    11.94   0.000     2179.503     3035.26
   Tbpl1_411 |   3121.423   332.5557     9.39   0.000     2469.619    3773.227
   Tbpl1_412 |   2917.513    542.163     5.38   0.000     1854.882    3980.145
   Tbpl1_414 |   724.9302    182.384     3.97   0.000     367.4602      1082.4
   Tbpl1_420 |  -839.9434   639.3194    -1.31   0.189        -2093    413.1132
   Tbpl1_421 |   932.5436   545.3015     1.71   0.087    -136.2393    2001.327
   Tbpl1_426 |   618.2585   551.0893     1.12   0.262    -461.8684    1698.385
   Tbpl1_436 |  -2957.706   475.5757    -6.22   0.000    -3889.828   -2025.585
   Tbpl1_450 |   1141.279    212.587     5.37   0.000     724.6121    1557.947
   Tbpl1_453 |   1834.342   181.1767    10.12   0.000     1479.238    2189.445
   Tbpl1_465 |   3385.765   223.9729    15.12   0.000     2946.781    3824.748
  Yyear_1910 |   588.0356   96.75969     6.08   0.000     398.3881    777.6832
  Yyear_1920 |   1326.791   140.5103     9.44   0.000     1051.393    1602.189
       _cons |   -3077.58   4373.701    -0.70   0.482    -11649.97    5494.811
------------------------------------------------------------------------------

. 
. /* Table 4: Use Cost of Living income instead*/
. reg income age age2 age3 age4 I* P* T* Y* [pw=weight2] if panel_flag==0
(sum of wgt is   2.0413e+05)
note: Panel omitted because of collinearity
note: PIyrsusa2_1 omitted because of collinearity
note: PIyrsusa2_2 omitted because of collinearity
note: PIyrsusa2_3 omitted because of collinearity
note: PIyrsusa2_4 omitted because of collinearity
note: PIyrsusa2_5 omitted because of collinearity
note: PC1 omitted because of collinearity

Linear regression                                      Number of obs =  204134
                                                       F( 26,204107) =  883.26
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0871
                                                       Root MSE      =  6428.8

------------------------------------------------------------------------------
             |               Robust
      income |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   2638.822   288.1479     9.16   0.000      2074.06    3203.585
        age2 |  -73.03147   12.86283    -5.68   0.000     -98.2423   -47.82064
        age3 |   .8703023   .2454044     3.55   0.000     .3893157    1.351289
        age4 |  -.0037381   .0016952    -2.21   0.027    -.0070606   -.0004155
  Iyrsusa2_1 |  -4176.517    122.471   -34.10   0.000    -4416.557   -3936.477
  Iyrsusa2_2 |    -3433.9    130.802   -26.25   0.000    -3690.269   -3177.532
  Iyrsusa2_3 |  -2670.613    117.837   -22.66   0.000    -2901.571   -2439.656
  Iyrsusa2_4 |  -2402.067   124.0828   -19.36   0.000    -2645.266   -2158.868
  Iyrsusa2_5 |  -1906.835   148.1351   -12.87   0.000    -2197.176   -1616.494
       Panel |          0  (omitted)
 PIyrsusa2_1 |          0  (omitted)
 PIyrsusa2_2 |          0  (omitted)
 PIyrsusa2_3 |          0  (omitted)
 PIyrsusa2_4 |          0  (omitted)
 PIyrsusa2_5 |          0  (omitted)
         PC1 |          0  (omitted)
   Tbpl1_400 |    2007.29    225.662     8.90   0.000     1564.998    2449.582
   Tbpl1_401 |  -320.8222   206.1613    -1.56   0.120    -724.8934    83.24888
   Tbpl1_404 |    1359.13   181.0189     7.51   0.000     1004.337    1713.922
   Tbpl1_405 |   1031.403   143.1367     7.21   0.000     750.8589    1311.948
   Tbpl1_410 |   2214.388   151.1873    14.65   0.000     1918.065    2510.712
   Tbpl1_411 |   2571.803   228.1843    11.27   0.000     2124.568    3019.039
   Tbpl1_412 |   1920.758   365.5871     5.25   0.000     1204.216      2637.3
   Tbpl1_414 |   151.1249   135.3511     1.12   0.264    -114.1599    416.4098
   Tbpl1_420 |   681.1228    403.525     1.69   0.091    -109.7764    1472.022
   Tbpl1_421 |   1739.652   331.1484     5.25   0.000     1090.609    2388.694
   Tbpl1_426 |   1418.069   287.5998     4.93   0.000       854.38    1981.757
   Tbpl1_436 |  -949.8981   367.9105    -2.58   0.010    -1670.994   -228.8025
   Tbpl1_450 |   810.5619   162.2516     5.00   0.000     492.5528    1128.571
   Tbpl1_453 |   2264.116   126.4199    17.91   0.000     2016.336    2511.896
   Tbpl1_465 |   3605.796   162.9224    22.13   0.000     3286.472     3925.12
  Yyear_1910 |   757.6705   48.35045    15.67   0.000     662.9048    852.4362
  Yyear_1920 |   809.9415   69.47534    11.66   0.000     673.7715    946.1114
       _cons |  -16304.99   2321.708    -7.02   0.000    -20855.48   -11754.49
------------------------------------------------------------------------------

. reg income age age2 age3 age4 I* P* C1 T* Y* [pw=weight2]
(sum of wgt is   2.4992e+05)

Linear regression                                      Number of obs =  261079
                                                       F( 34,261044) =  503.96
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0904
                                                       Root MSE      =  6406.2

------------------------------------------------------------------------------
             |               Robust
      income |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   2484.628   382.6838     6.49   0.000     1734.578    3234.678
        age2 |  -65.79628   17.05047    -3.86   0.000    -99.21475   -32.37781
        age3 |   .7321572   .3246297     2.26   0.024     .0958918    1.368423
        age4 |  -.0027978    .002238    -1.25   0.211    -.0071842    .0015885
  Iyrsusa2_1 |  -3286.337   150.5139   -21.83   0.000     -3581.34   -2991.333
  Iyrsusa2_2 |  -2723.761   144.1013   -18.90   0.000    -3006.195   -2441.326
  Iyrsusa2_3 |  -2200.141   115.7428   -19.01   0.000    -2426.994   -1973.288
  Iyrsusa2_4 |  -2032.188   117.9475   -17.23   0.000    -2263.361   -1801.014
  Iyrsusa2_5 |  -1773.973   139.5691   -12.71   0.000    -2047.524   -1500.421
       Panel |   580.0264   104.4363     5.55   0.000     375.3342    784.7187
 PIyrsusa2_1 |  -2558.656   200.0576   -12.79   0.000    -2950.763   -2166.548
 PIyrsusa2_2 |  -1900.416   174.1059   -10.92   0.000    -2241.659   -1559.173
 PIyrsusa2_3 |  -1859.928   124.7566   -14.91   0.000    -2104.448   -1615.409
 PIyrsusa2_4 |  -1896.779   124.7871   -15.20   0.000    -2141.359     -1652.2
 PIyrsusa2_5 |  -1634.053   144.5204   -11.31   0.000    -1917.309   -1350.797
         PC1 |   456.0853   127.8978     3.57   0.000     205.4092    706.7615
          C1 |  -740.3719   82.92144    -8.93   0.000    -902.8957   -577.8481
   Tbpl1_400 |   1877.755   176.1994    10.66   0.000     1532.409    2223.101
   Tbpl1_401 |  -445.7579   168.3734    -2.65   0.008    -775.7652   -115.7507
   Tbpl1_404 |   1162.237   153.9092     7.55   0.000     860.5793    1463.895
   Tbpl1_405 |   945.3784    122.646     7.71   0.000     704.9955    1185.761
   Tbpl1_410 |   1986.311   130.0555    15.27   0.000     1731.405    2241.216
   Tbpl1_411 |   2280.896   181.5073    12.57   0.000     1925.147    2636.646
   Tbpl1_412 |   1428.794   282.5685     5.06   0.000     874.9678    1982.621
   Tbpl1_414 |   6.585374   116.5299     0.06   0.955    -221.8101    234.9809
   Tbpl1_420 |   587.5413   309.6469     1.90   0.058     -19.3582    1194.441
   Tbpl1_421 |   1687.894   246.2114     6.86   0.000     1205.326    2170.461
   Tbpl1_426 |   1345.201   221.3824     6.08   0.000     911.2979    1779.105
   Tbpl1_436 |  -973.3392   278.7322    -3.49   0.000    -1519.647   -427.0315
   Tbpl1_450 |   661.2242   141.4176     4.68   0.000     384.0495    938.3989
   Tbpl1_453 |   2021.491   108.9337    18.56   0.000     1807.984    2234.998
   Tbpl1_465 |   3657.397   138.7953    26.35   0.000     3385.362    3929.432
  Yyear_1910 |   768.6226   66.16668    11.62   0.000     638.9377    898.3075
  Yyear_1920 |    787.776   95.03656     8.29   0.000     601.5069    974.0451
       _cons |  -15241.27   3088.407    -4.93   0.000    -21294.46   -9188.072
------------------------------------------------------------------------------

. /* Calculate 1950 occupation-based earnings that are as close as possible to the 1901 Cost of Living survey. That is, calculate *mean* (rather than median) 
> earnings for *urban workers* only. Replace farmer earnings with 1900 Census of Agriculture*/
. sort occ1950_all

. drop _merge

. merge occ1950_all using urb_rural_occscores.dta
(note: you are using old merge syntax; see [D] merge for new syntax)
variable occ1950_all does not uniquely identify observations in the master data
(label occ1950_lbl already defined)

. drop _merge

. /* Adjust for CPI to 2010 dollars*/
. gen occscore_adj=inctot_mean*9.06
(6755 missing values generated)

. /* Replace DV = 1900 Census of Ag. based estimate of earnings for owner-occupier farmers*/
. replace occscore_adj=income if occ1950_all>=100 & occ1950_all<=120
(41900 real changes made)

. reg occscore_adj age age2 age3 age4 I* P* T* Y* [pw=weight2] if panel_flag==0
(sum of wgt is   2.0543e+05)
note: Panel omitted because of collinearity
note: PIyrsusa2_1 omitted because of collinearity
note: PIyrsusa2_2 omitted because of collinearity
note: PIyrsusa2_3 omitted because of collinearity
note: PIyrsusa2_4 omitted because of collinearity
note: PIyrsusa2_5 omitted because of collinearity
note: PC1 omitted because of collinearity

Linear regression                                      Number of obs =  205428
                                                       F( 26,205401) =  464.23
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0431
                                                       Root MSE      =  8606.7

------------------------------------------------------------------------------
             |               Robust
occscore_adj |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |    2914.72   378.6899     7.70   0.000     2172.497    3656.943
        age2 |  -89.09001   16.93303    -5.26   0.000    -122.2783   -55.90169
        age3 |    1.21947   .3235437     3.77   0.000     .5853323    1.853608
        age4 |  -.0064287    .002238    -2.87   0.004     -.010815   -.0020423
  Iyrsusa2_1 |  -3186.658    138.044   -23.08   0.000    -3457.221   -2916.096
  Iyrsusa2_2 |  -2450.125   144.8915   -16.91   0.000    -2734.109   -2166.141
  Iyrsusa2_3 |   -1783.47   131.0842   -13.61   0.000    -2040.392   -1526.548
  Iyrsusa2_4 |  -1540.321   139.8935   -11.01   0.000    -1814.509   -1266.133
  Iyrsusa2_5 |  -1146.959   175.0264    -6.55   0.000    -1490.007   -803.9115
       Panel |          0  (omitted)
 PIyrsusa2_1 |          0  (omitted)
 PIyrsusa2_2 |          0  (omitted)
 PIyrsusa2_3 |          0  (omitted)
 PIyrsusa2_4 |          0  (omitted)
 PIyrsusa2_5 |          0  (omitted)
         PC1 |          0  (omitted)
   Tbpl1_400 |  -464.4803   272.6486    -1.70   0.088    -998.8649    69.90424
   Tbpl1_401 |   -1898.41   227.7891    -8.33   0.000    -2344.871   -1451.949
   Tbpl1_404 |  -750.6212   215.3883    -3.48   0.000    -1172.777   -328.4655
   Tbpl1_405 |  -211.6196   166.0708    -1.27   0.203    -537.1144    113.8751
   Tbpl1_410 |   2508.671   178.5766    14.05   0.000     2158.665    2858.677
   Tbpl1_411 |   2768.612   275.1758    10.06   0.000     2229.274    3307.949
   Tbpl1_412 |   1892.019    447.853     4.22   0.000     1014.238      2769.8
   Tbpl1_414 |   618.2494   150.5482     4.11   0.000     323.1787    913.3202
   Tbpl1_420 |  -1124.356   484.1023    -2.32   0.020    -2073.185   -175.5271
   Tbpl1_421 |   1366.277   397.1824     3.44   0.001     587.8091    2144.745
   Tbpl1_426 |  -496.9751   354.3389    -1.40   0.161    -1191.471    197.5205
   Tbpl1_436 |  -2295.648   380.9693    -6.03   0.000    -3042.339   -1548.958
   Tbpl1_450 |   560.8744   176.4326     3.18   0.001     215.0708     906.678
   Tbpl1_453 |   1296.339   143.0246     9.06   0.000     1016.015    1576.664
   Tbpl1_465 |   4076.059   182.1743    22.37   0.000     3719.002    4433.116
  Yyear_1910 |   752.2504   64.51318    11.66   0.000     625.8061    878.6946
  Yyear_1920 |   1191.551   93.29796    12.77   0.000     1008.689    1374.412
       _cons |  -8295.151   3045.682    -2.72   0.006    -14264.61   -2325.689
------------------------------------------------------------------------------

. reg occscore_adj age age2 age3 age4 I* P* C1 T* Y* [pw=weight2]
(sum of wgt is   2.5079e+05)

Linear regression                                      Number of obs =  258725
                                                       F( 34,258690) =  286.82
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0435
                                                       Root MSE      =  8603.4

------------------------------------------------------------------------------
             |               Robust
occscore_adj |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |    3143.68   522.6429     6.01   0.000     2119.314    4168.046
        age2 |  -98.53365    23.3358    -4.22   0.000    -144.2712   -52.79611
        age3 |   1.377807   .4452049     3.09   0.002     .5052168    2.250396
        age4 |  -.0073656   .0030752    -2.40   0.017    -.0133928   -.0013383
  Iyrsusa2_1 |  -2364.007   175.4515   -13.47   0.000    -2707.887   -2020.127
  Iyrsusa2_2 |  -1797.876   165.0953   -10.89   0.000    -2121.459   -1474.294
  Iyrsusa2_3 |  -1361.638   131.6875   -10.34   0.000    -1619.742   -1103.534
  Iyrsusa2_4 |  -1227.394   135.5392    -9.06   0.000    -1493.047   -961.7409
  Iyrsusa2_5 |   -1107.02    168.413    -6.57   0.000    -1437.105   -776.9348
       Panel |   28.21607   145.8473     0.19   0.847    -257.6408    314.0729
 PIyrsusa2_1 |  -2354.069   240.6693    -9.78   0.000    -2825.775   -1882.364
 PIyrsusa2_2 |   -1521.15   206.1981    -7.38   0.000    -1925.293   -1117.008
 PIyrsusa2_3 |  -1241.916   145.4007    -8.54   0.000    -1526.897   -956.9343
 PIyrsusa2_4 |  -1127.699    146.224    -7.71   0.000    -1414.294   -841.1036
 PIyrsusa2_5 |  -814.9765   177.3317    -4.60   0.000    -1162.542   -467.4111
         PC1 |   725.5878   150.8651     4.81   0.000     429.8962    1021.279
          C1 |  -745.8672    97.8949    -7.62   0.000    -937.7386   -553.9959
   Tbpl1_400 |  -470.3297   214.9559    -2.19   0.029    -891.6375   -49.02192
   Tbpl1_401 |  -2091.904   188.0156   -11.13   0.000     -2460.41   -1723.399
   Tbpl1_404 |  -982.6046   184.1014    -5.34   0.000    -1343.438   -621.7707
   Tbpl1_405 |   -259.383   143.3903    -1.81   0.070    -540.4241    21.65813
   Tbpl1_410 |    2385.44   154.8357    15.41   0.000     2081.967    2688.914
   Tbpl1_411 |   2648.201   224.2237    11.81   0.000     2208.729    3087.674
   Tbpl1_412 |   1576.558   352.0164     4.48   0.000      886.615      2266.5
   Tbpl1_414 |   594.0741   131.1773     4.53   0.000     336.9702     851.178
   Tbpl1_420 |  -1063.645   376.5679    -2.82   0.005    -1801.708   -325.5825
   Tbpl1_421 |   1436.968   303.7328     4.73   0.000     841.6602    2032.277
   Tbpl1_426 |  -578.4356   274.0966    -2.11   0.035    -1115.658   -41.21356
   Tbpl1_436 |  -2397.667   294.2198    -8.15   0.000    -2974.329   -1821.004
   Tbpl1_450 |   556.5843   155.6884     3.57   0.000     251.4392    861.7293
   Tbpl1_453 |   1155.173   124.8299     9.25   0.000     910.5092    1399.836
   Tbpl1_465 |   4190.164   156.5395    26.77   0.000     3883.351    4496.977
  Yyear_1910 |    881.412   88.93627     9.91   0.000     707.0993    1055.725
  Yyear_1920 |   1400.623   129.7286    10.80   0.000     1146.358    1654.888
       _cons |  -10242.15   4207.377    -2.43   0.015     -18488.5   -1995.803
------------------------------------------------------------------------------

. 
. 
. /* For online appendix*/
. /* Hatton specification*/
. reg occscore_all exp age35 age35exp I* P* T* Y* [pw=weight2] if panel_flag==0
(sum of wgt is   2.0546e+05)
note: Panel omitted because of collinearity
note: PIyrsusa2_1 omitted because of collinearity
note: PIyrsusa2_2 omitted because of collinearity
note: PIyrsusa2_3 omitted because of collinearity
note: PIyrsusa2_4 omitted because of collinearity
note: PIyrsusa2_5 omitted because of collinearity
note: PC1 omitted because of collinearity

Linear regression                                      Number of obs =  205458
                                                       F( 25,205432) =  376.36
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0338
                                                       Root MSE      =    9840

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         exp |   327.4735   6.855079    47.77   0.000     314.0377    340.9093
       age35 |   12345.63   346.0236    35.68   0.000     11667.44    13023.83
    age35exp |  -375.2283   9.737657   -38.53   0.000    -394.3139   -356.1427
  Iyrsusa2_1 |  -1192.287   142.8995    -8.34   0.000    -1472.367   -912.2078
  Iyrsusa2_2 |  -682.0443   147.4903    -4.62   0.000    -971.1216    -392.967
  Iyrsusa2_3 |  -386.0937   131.2327    -2.94   0.003    -643.3066   -128.8809
  Iyrsusa2_4 |  -280.8394   142.0222    -1.98   0.048    -559.1994    -2.47937
  Iyrsusa2_5 |  -24.67807   184.2671    -0.13   0.893    -385.8371     336.481
       Panel |          0  (omitted)
 PIyrsusa2_1 |          0  (omitted)
 PIyrsusa2_2 |          0  (omitted)
 PIyrsusa2_3 |          0  (omitted)
 PIyrsusa2_4 |          0  (omitted)
 PIyrsusa2_5 |          0  (omitted)
         PC1 |          0  (omitted)
   Tbpl1_400 |  -2272.891   303.9206    -7.48   0.000    -2868.568   -1677.214
   Tbpl1_401 |  -1797.674    268.066    -6.71   0.000    -2323.077   -1272.271
   Tbpl1_404 |  -2404.216   238.8769   -10.06   0.000    -2872.409   -1936.023
   Tbpl1_405 |  -1052.147    179.079    -5.88   0.000    -1403.138   -701.1568
   Tbpl1_410 |   2125.838   184.8171    11.50   0.000     1763.601    2488.075
   Tbpl1_411 |   2620.465   288.0391     9.10   0.000     2055.915    3185.014
   Tbpl1_412 |    2310.28   473.6243     4.88   0.000     1381.988    3238.572
   Tbpl1_414 |   680.5759   153.5478     4.43   0.000      379.626    981.5258
   Tbpl1_420 |  -1903.613   576.0098    -3.30   0.001    -3032.578   -774.6483
   Tbpl1_421 |   426.4961   428.1298     1.00   0.319    -412.6278     1265.62
   Tbpl1_426 |  -2035.034     403.44    -5.04   0.000    -2825.767   -1244.302
   Tbpl1_436 |  -3433.994    425.269    -8.07   0.000    -4267.511   -2600.477
   Tbpl1_450 |   743.0405   176.3556     4.21   0.000     397.3879    1088.693
   Tbpl1_453 |   371.3576   147.5313     2.52   0.012     82.19985    660.5153
   Tbpl1_465 |   3148.495   186.5458    16.88   0.000      2782.87     3514.12
  Yyear_1910 |   830.8016   72.72968    11.42   0.000     688.2532      973.35
  Yyear_1920 |   1562.569    106.187    14.72   0.000     1354.445    1770.693
       _cons |   11375.34    175.689    64.75   0.000        11031    11719.69
------------------------------------------------------------------------------

. reg occscore_all exp age35 age35exp I* P* C1 T* Y* [pw=weight2]
(sum of wgt is   2.4882e+05)

Linear regression                                      Number of obs =  259093
                                                       F( 33,259059) =  214.00
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0337
                                                       Root MSE      =    9859

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         exp |   316.1641   9.158338    34.52   0.000      298.214    334.1142
       age35 |   12322.61   465.7631    26.46   0.000     11409.72    13235.49
    age35exp |   -375.482   13.01654   -28.85   0.000    -400.9941   -349.9699
  Iyrsusa2_1 |    -321.68   186.7981    -1.72   0.085    -687.7992    44.43922
  Iyrsusa2_2 |   52.60176   171.9261     0.31   0.760    -284.3688    389.5723
  Iyrsusa2_3 |   132.5803   133.8927     0.99   0.322    -129.8458    395.0064
  Iyrsusa2_4 |    135.526   138.7052     0.98   0.329    -136.3325    407.3845
  Iyrsusa2_5 |   109.7333   178.1181     0.62   0.538    -239.3734    458.8401
       Panel |   -153.736   176.3936    -0.87   0.383    -499.4627    191.9908
 PIyrsusa2_1 |   321.4955   237.2888     1.35   0.175    -143.5842    786.5751
 PIyrsusa2_2 |   510.7406    213.463     2.39   0.017     92.35882    929.1224
 PIyrsusa2_3 |   277.2036   150.4424     1.84   0.065     -17.6595    572.0666
 PIyrsusa2_4 |   73.06103   150.2351     0.49   0.627    -221.3957    367.5178
 PIyrsusa2_5 |   179.2472   185.4643     0.97   0.334    -184.2579    542.7522
         PC1 |   504.7681   160.6114     3.14   0.002      189.974    819.5621
          C1 |  -733.8861   107.0416    -6.86   0.000    -943.6847   -524.0876
   Tbpl1_400 |  -2336.265   237.4943    -9.84   0.000    -2801.748   -1870.783
   Tbpl1_401 |  -2184.062    219.084    -9.97   0.000    -2613.461   -1754.663
   Tbpl1_404 |  -2774.372   203.1446   -13.66   0.000     -3172.53   -2376.215
   Tbpl1_405 |  -1200.555   153.6589    -7.81   0.000    -1501.722   -899.3877
   Tbpl1_410 |   1935.454    159.079    12.17   0.000     1623.664    2247.245
   Tbpl1_411 |   2437.975    233.415    10.44   0.000     1980.488    2895.462
   Tbpl1_412 |   1897.444   369.8277     5.13   0.000     1172.592    2622.297
   Tbpl1_414 |   580.3403   132.6047     4.38   0.000     320.4387    840.2419
   Tbpl1_420 |  -1854.717   446.3027    -4.16   0.000    -2729.459   -979.9762
   Tbpl1_421 |   475.3093   325.5105     1.46   0.144    -162.6825    1113.301
   Tbpl1_426 |  -2186.589   309.7812    -7.06   0.000    -2793.751   -1579.426
   Tbpl1_436 |  -3741.803   326.9982   -11.44   0.000    -4382.711   -3100.896
   Tbpl1_450 |   630.5048   155.0506     4.07   0.000     326.6099    934.3998
   Tbpl1_453 |   146.3184   127.4125     1.15   0.251    -103.4067    396.0435
   Tbpl1_465 |   3109.844   159.1204    19.54   0.000     2797.972    3421.716
  Yyear_1910 |   960.3817   102.9395     9.33   0.000      758.623     1162.14
  Yyear_1920 |   1906.479   150.4974    12.67   0.000     1611.509     2201.45
       _cons |   11642.52   236.7655    49.17   0.000     11178.47    12106.57
------------------------------------------------------------------------------

. /* Separate RCS and panel*/
. reg occscore_all age age2 age3 age4 I* P* C1 T* Y* [pw=weight2] if panel_flag==0
(sum of wgt is   2.0546e+05)
note: Panel omitted because of collinearity
note: PIyrsusa2_1 omitted because of collinearity
note: PIyrsusa2_2 omitted because of collinearity
note: PIyrsusa2_3 omitted because of collinearity
note: PIyrsusa2_4 omitted because of collinearity
note: PIyrsusa2_5 omitted because of collinearity
note: PC1 omitted because of collinearity

Linear regression                                      Number of obs =  205458
                                                       F( 27,205430) =  376.14
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0348
                                                       Root MSE      =  9834.9

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |    2526.53   426.4465     5.92   0.000     1690.705    3362.354
        age2 |  -69.22727   19.12836    -3.62   0.000    -106.7184   -31.73614
        age3 |   .8054369   .3664096     2.20   0.028      .087283    1.523591
        age4 |  -.0034461   .0025397    -1.36   0.175    -.0084239    .0015318
  Iyrsusa2_1 |  -447.4304   186.5874    -2.40   0.016    -813.1371   -81.72363
  Iyrsusa2_2 |  -71.92278   177.5164    -0.41   0.685    -419.8505     276.005
  Iyrsusa2_3 |    91.3016   145.5699     0.63   0.531    -194.0119    376.6151
  Iyrsusa2_4 |   53.85513   151.1822     0.36   0.722    -242.4582    350.1685
  Iyrsusa2_5 |   124.0945    184.866     0.67   0.502    -238.2383    486.4274
       Panel |          0  (omitted)
 PIyrsusa2_1 |          0  (omitted)
 PIyrsusa2_2 |          0  (omitted)
 PIyrsusa2_3 |          0  (omitted)
 PIyrsusa2_4 |          0  (omitted)
 PIyrsusa2_5 |          0  (omitted)
         PC1 |          0  (omitted)
          C1 |  -703.5808   104.3742    -6.74   0.000    -908.1517   -499.0099
   Tbpl1_400 |  -2385.318   304.9371    -7.82   0.000    -2982.987   -1787.649
   Tbpl1_401 |  -1836.446   266.5602    -6.89   0.000    -2358.897   -1313.995
   Tbpl1_404 |   -2534.76   239.4446   -10.59   0.000    -3004.066   -2065.455
   Tbpl1_405 |  -1164.978   179.6776    -6.48   0.000    -1517.142   -812.8145
   Tbpl1_410 |   1957.802   186.2021    10.51   0.000     1592.851    2322.754
   Tbpl1_411 |     2450.2   290.2723     8.44   0.000     1881.274    3019.127
   Tbpl1_412 |   2148.958   473.1964     4.54   0.000     1221.504    3076.411
   Tbpl1_414 |   522.0102      154.6     3.38   0.001      218.998    825.0224
   Tbpl1_420 |  -1988.295   574.8223    -3.46   0.001    -3114.933   -861.6572
   Tbpl1_421 |   337.4388   427.0331     0.79   0.429    -499.5356    1174.413
   Tbpl1_426 |  -2166.032   402.1878    -5.39   0.000     -2954.31   -1377.754
   Tbpl1_436 |  -3501.824   424.9951    -8.24   0.000    -4334.804   -2668.844
   Tbpl1_450 |    695.189   176.2185     3.95   0.000     349.8049    1040.573
   Tbpl1_453 |   191.8482   149.3511     1.28   0.199    -100.8763    484.5728
   Tbpl1_465 |   3103.081   186.3203    16.65   0.000     2737.898    3468.264
  Yyear_1910 |   872.4111   74.94568    11.64   0.000     725.5194    1019.303
  Yyear_1920 |   1600.233   109.2218    14.65   0.000      1386.16    1814.305
       _cons |  -11142.74   3416.254    -3.26   0.001    -17838.51   -4446.963
------------------------------------------------------------------------------

. reg occscore_all age age2 age3 age4  PI* C1 T* Y* [pw=weight2] if panel_flag==1
(sum of wgt is   4.3359e+04)

Linear regression                                      Number of obs =   53635
                                                       F( 27, 53607) =  150.53
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0362
                                                       Root MSE      =  9934.6

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   5932.675   2557.168     2.32   0.020     920.6047    10944.75
        age2 |  -214.5914   113.8032    -1.89   0.059    -437.6465    8.463742
        age3 |    3.39895   2.159089     1.57   0.115    -.8328815    7.630781
        age4 |  -.0201886   .0148102    -1.36   0.173    -.0492167    .0088395
 PIyrsusa2_1 |   569.2984   452.3119     1.26   0.208    -317.2366    1455.833
 PIyrsusa2_2 |   765.7778   420.6867     1.82   0.069    -58.77155    1590.327
 PIyrsusa2_3 |    677.055   318.9239     2.12   0.034     51.96158    1302.148
 PIyrsusa2_4 |   336.9274   291.6355     1.16   0.248    -234.6806    908.5354
 PIyrsusa2_5 |   312.5291   399.9381     0.78   0.435    -471.3529    1096.411
          C1 |  -441.4124   217.6735    -2.03   0.043    -868.0543   -14.77052
   Tbpl1_400 |  -1947.498   256.6756    -7.59   0.000    -2450.585   -1444.412
   Tbpl1_401 |  -3379.102   253.4403   -13.33   0.000    -3875.847   -2882.357
   Tbpl1_404 |  -3549.904    328.139   -10.82   0.000    -4193.059   -2906.749
   Tbpl1_405 |  -1143.534   298.5024    -3.83   0.000    -1728.602   -558.4673
   Tbpl1_410 |   2015.823   285.8612     7.05   0.000     1455.532    2576.113
   Tbpl1_411 |    2527.79   206.4759    12.24   0.000     2123.095    2932.484
   Tbpl1_412 |   1260.502   241.9189     5.21   0.000     786.3389    1734.665
   Tbpl1_414 |   938.0565   256.9494     3.65   0.000     434.4336    1441.679
   Tbpl1_420 |  -1322.585   294.9981    -4.48   0.000    -1900.784   -744.3863
   Tbpl1_421 |   1088.145   329.9638     3.30   0.001     441.4133    1734.877
   Tbpl1_426 |  -1997.737   247.2758    -8.08   0.000      -2482.4   -1513.074
   Tbpl1_436 |   -4331.84    276.193   -15.68   0.000    -4873.181     -3790.5
   Tbpl1_450 |   425.2712   327.6773     1.30   0.194     -216.979    1067.521
   Tbpl1_453 |   113.6216   237.0176     0.48   0.632    -350.9349     578.178
   Tbpl1_465 |     3252.1   288.8677    11.26   0.000     2685.917    3818.284
  Yyear_1910 |   1403.036    498.439     2.81   0.005      426.091     2379.98
  Yyear_1920 |   3147.626   700.7108     4.49   0.000     1774.227    4521.025
       _cons |  -39242.51   20578.03    -1.91   0.057    -79575.61    1090.601
------------------------------------------------------------------------------

. /* Drop countries that have mismatch between panel sample and population - Mentioned in Appendix in paper*/
. reg occscore_all age age2 age3 age4 I* P* Y* T* C1 [pw=weight2] if (bpl!=420 | bpl!=414 | bpl!=421 | bpl!=404)
(sum of wgt is   2.4882e+05)

Linear regression                                      Number of obs =  259093
                                                       F( 34,259058) =  226.36
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0348
                                                       Root MSE      =  9853.4

------------------------------------------------------------------------------
             |               Robust
occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         age |   3132.283    582.581     5.38   0.000      1990.44    4274.126
        age2 |  -95.12096   26.06383    -3.65   0.000    -146.2054   -44.03656
        age3 |   1.268848   .4976197     2.55   0.011     .2935267    2.244169
        age4 |  -.0064514   .0034366    -1.88   0.060    -.0131872    .0002843
  Iyrsusa2_1 |  -384.4954   187.3031    -2.05   0.040    -751.6045    -17.3863
  Iyrsusa2_2 |  -2.891939   172.0516    -0.02   0.987    -340.1084    334.3245
  Iyrsusa2_3 |   173.8321   134.0204     1.30   0.195    -88.84425    436.5084
  Iyrsusa2_4 |   128.4394   138.9263     0.92   0.355    -143.8524    400.7312
  Iyrsusa2_5 |   155.7659   178.4948     0.87   0.383    -194.0792     505.611
       Panel |  -153.8329   176.1422    -0.87   0.382     -499.067    191.4011
 PIyrsusa2_1 |    293.505   237.9648     1.23   0.217    -172.8996    759.9097
 PIyrsusa2_2 |   467.6477   213.6066     2.19   0.029     48.98459    886.3109
 PIyrsusa2_3 |   329.3896   150.4912     2.19   0.029     34.43095    624.3483
 PIyrsusa2_4 |   74.34657   150.3348     0.49   0.621    -220.3056    368.9987
 PIyrsusa2_5 |   231.9007   186.5563     1.24   0.214    -133.7446     597.546
         PC1 |   507.7767   160.5802     3.16   0.002     193.0438    822.5095
  Yyear_1910 |      965.8    104.327     9.26   0.000     761.3219    1170.278
  Yyear_1920 |    1875.72   151.0886    12.41   0.000     1579.591     2171.85
   Tbpl1_400 |   -2327.62   237.5379    -9.80   0.000    -2793.188   -1862.052
   Tbpl1_401 |  -2192.508   218.5153   -10.03   0.000    -2620.792   -1764.224
   Tbpl1_404 |  -2773.699    203.218   -13.65   0.000    -3172.001   -2375.397
   Tbpl1_405 |  -1198.097   153.6924    -7.80   0.000     -1499.33   -896.8638
   Tbpl1_410 |   1931.525   159.0928    12.14   0.000     1619.707    2243.342
   Tbpl1_411 |   2443.896   233.7286    10.46   0.000     1985.794    2901.997
   Tbpl1_412 |   1907.884   369.4178     5.16   0.000     1183.835    2631.933
   Tbpl1_414 |   559.1174   132.6361     4.22   0.000     299.1542    819.0806
   Tbpl1_420 |  -1873.131    445.701    -4.20   0.000    -2746.693   -999.5695
   Tbpl1_421 |   475.9541   325.7875     1.46   0.144    -162.5807    1114.489
   Tbpl1_426 |  -2179.738   309.4491    -7.04   0.000     -2786.25   -1573.226
   Tbpl1_436 |  -3756.458   326.0346   -11.52   0.000    -4395.477   -3117.439
   Tbpl1_450 |   619.8555   155.0791     4.00   0.000     315.9046    923.8065
   Tbpl1_453 |   140.4735   127.4746     1.10   0.270    -109.3734    390.3203
   Tbpl1_465 |   3096.437   159.1077    19.46   0.000      2784.59    3408.284
          C1 |  -739.1812   106.9975    -6.91   0.000    -948.8935   -529.4689
       _cons |  -16108.58   4673.236    -3.45   0.001       -25268   -6949.164
------------------------------------------------------------------------------

. 
. 
. /*Country-by-country results -- Figures 3-5*/
. 
. /* Create an indicator for Italy, which up until now has been the omitted category among the foreign-born, given that we include two sets of indicator variables 
> that completely span the foreign born: (1) years in US and (2) country of origin*/
. gen Tbpl1_434=(bpl==434)

. 
. /* Create interactions between county-of-origin dummies and years spent in US dummies for the panel sample*/
. foreach var of varlist T* {
  2. gen PIyrs1_`var'=`var'*PIyrsusa2_1
  3. gen PIyrs2_`var'=`var'*PIyrsusa2_2
  4. gen PIyrs3_`var'=`var'*PIyrsusa2_3
  5. gen PIyrs4_`var'=`var'*PIyrsusa2_4
  6. gen PIyrs5_`var'=`var'*PIyrsusa2_5
  7. }
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)

. reg occscore_all age age2 age3 age4 PIyrs1* PIyrs2* PIyrs3* PIyrs4* PIyrs5* Y* [pw=weight2] if panel_flag==1 
(sum of wgt is   4.3359e+04)

Linear regression                                      Number of obs =   53635
                                                       F( 86, 53548) =   56.52
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0364
                                                       Root MSE      =  9939.1

----------------------------------------------------------------------------------
                 |               Robust
    occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-----------------+----------------------------------------------------------------
             age |   5905.626   2567.939     2.30   0.021     872.4441    10938.81
            age2 |  -213.3636   114.3463    -1.87   0.062    -437.4832    10.75606
            age3 |   3.377067   2.170659     1.56   0.120    -.8774433    7.631577
            age4 |  -.0200567   .0148969    -1.35   0.178    -.0492546    .0091413
PIyrs1_Tbpl1_400 |  -2135.963   857.8975    -2.49   0.013    -3817.449   -454.4767
PIyrs1_Tbpl1_401 |  -1097.734   468.5135    -2.34   0.019    -2016.024   -179.4436
PIyrs1_Tbpl1_404 |  -4205.948    1046.47    -4.02   0.000    -6257.038   -2154.858
PIyrs1_Tbpl1_405 |  -1001.267   700.2643    -1.43   0.153    -2373.791    371.2567
PIyrs1_Tbpl1_410 |   3064.699    956.786     3.20   0.001     1189.391    4940.008
PIyrs1_Tbpl1_411 |   2365.018   523.7385     4.52   0.000     1338.487     3391.55
PIyrs1_Tbpl1_412 |   2861.186   723.0092     3.96   0.000     1444.082     4278.29
PIyrs1_Tbpl1_414 |   532.7596   482.7603     1.10   0.270    -413.4545    1478.974
PIyrs1_Tbpl1_420 |  -2586.866   1148.751    -2.25   0.024    -4838.427   -335.3049
PIyrs1_Tbpl1_421 |   1680.145   1063.672     1.58   0.114    -404.6609    3764.951
PIyrs1_Tbpl1_426 |  -2064.441   581.2038    -3.55   0.000    -3203.606   -925.2771
PIyrs1_Tbpl1_436 |  -4127.108   754.6283    -5.47   0.000    -5606.185    -2648.03
PIyrs1_Tbpl1_450 |   345.1806   449.0916     0.77   0.442    -535.0426    1225.404
PIyrs1_Tbpl1_453 |   638.3658   821.7074     0.78   0.437    -972.1875    2248.919
PIyrs1_Tbpl1_465 |   2639.126   632.1367     4.17   0.000     1400.133    3878.119
PIyrs1_Tbpl1_434 |    322.599   372.5005     0.87   0.386     -407.505    1052.703
PIyrs2_Tbpl1_400 |  -1836.988   436.2207    -4.21   0.000    -2691.984   -981.9921
PIyrs2_Tbpl1_401 |  -2186.154    424.407    -5.15   0.000    -3017.996   -1354.313
PIyrs2_Tbpl1_404 |  -3361.579   734.7436    -4.58   0.000    -4801.683   -1921.476
PIyrs2_Tbpl1_405 |   -431.018    594.185    -0.73   0.468    -1595.626    733.5897
PIyrs2_Tbpl1_410 |    2448.41   691.2492     3.54   0.000     1093.556    3803.265
PIyrs2_Tbpl1_411 |   2814.424     368.78     7.63   0.000     2091.612    3537.235
PIyrs2_Tbpl1_412 |    656.007   563.7856     1.16   0.245    -449.0174    1761.031
PIyrs2_Tbpl1_414 |    1903.89   501.4797     3.80   0.000     920.9859    2886.795
PIyrs2_Tbpl1_420 |  -1057.899   613.7206    -1.72   0.085    -2260.796    144.9984
PIyrs2_Tbpl1_421 |   1323.335   748.8269     1.77   0.077    -144.3722    2791.041
PIyrs2_Tbpl1_426 |  -1872.528   397.8768    -4.71   0.000     -2652.37   -1092.686
PIyrs2_Tbpl1_436 |      -4923   491.0639   -10.03   0.000    -5885.489    -3960.51
PIyrs2_Tbpl1_450 |   584.4561   631.7537     0.93   0.355    -653.7864    1822.699
PIyrs2_Tbpl1_453 |   353.0672   431.6627     0.82   0.413    -492.9952     1199.13
PIyrs2_Tbpl1_465 |   3644.643   600.5089     6.07   0.000      2467.64    4821.645
PIyrs2_Tbpl1_434 |   316.1683   438.2498     0.72   0.471    -542.8049    1175.141
PIyrs3_Tbpl1_400 |  -1655.883   309.0974    -5.36   0.000    -2261.716    -1050.05
PIyrs3_Tbpl1_401 |   -2739.06   311.4031    -8.80   0.000    -3349.412   -2128.707
PIyrs3_Tbpl1_404 |  -2752.342   479.2038    -5.74   0.000    -3691.586   -1813.099
PIyrs3_Tbpl1_405 |  -607.5102   441.1908    -1.38   0.169    -1472.248    257.2275
PIyrs3_Tbpl1_410 |    2411.98   393.5354     6.13   0.000     1640.648    3183.313
PIyrs3_Tbpl1_411 |    3073.82   251.1818    12.24   0.000     2581.501    3566.138
PIyrs3_Tbpl1_412 |   1422.712   313.5198     4.54   0.000     808.2108    2037.213
PIyrs3_Tbpl1_414 |     1157.8   329.1636     3.52   0.000     512.6369    1802.964
PIyrs3_Tbpl1_420 |   -882.065   418.8432    -2.11   0.035    -1703.001   -61.12884
PIyrs3_Tbpl1_421 |    884.536   441.6294     2.00   0.045     18.93871    1750.133
PIyrs3_Tbpl1_426 |  -1519.249   278.7535    -5.45   0.000    -2065.608   -972.8901
PIyrs3_Tbpl1_436 |  -4599.884   375.4259   -12.25   0.000    -5335.722   -3864.046
PIyrs3_Tbpl1_450 |   1038.713   507.0954     2.05   0.041     44.80138    2032.624
PIyrs3_Tbpl1_453 |    708.188   280.0743     2.53   0.011       159.24    1257.136
PIyrs3_Tbpl1_465 |   3596.987   420.8871     8.55   0.000     2772.045    4421.929
PIyrs3_Tbpl1_434 |   810.1161   353.4854     2.29   0.022     117.2817    1502.951
PIyrs4_Tbpl1_400 |   -1752.34   317.1629    -5.53   0.000    -2373.982   -1130.698
PIyrs4_Tbpl1_401 |  -4274.171   338.9964   -12.61   0.000    -4938.606   -3609.735
PIyrs4_Tbpl1_404 |  -3572.708   467.3094    -7.65   0.000    -4488.639   -2656.778
PIyrs4_Tbpl1_405 |  -1081.088   432.0457    -2.50   0.012    -1927.902   -234.2753
PIyrs4_Tbpl1_410 |   1983.064   402.1578     4.93   0.000     1194.832    2771.297
PIyrs4_Tbpl1_411 |   2664.967   266.9445     9.98   0.000     2141.753     3188.18
PIyrs4_Tbpl1_412 |   1660.935   319.4127     5.20   0.000     1034.883    2286.986
PIyrs4_Tbpl1_414 |   1099.523   357.2615     3.08   0.002     399.2873    1799.758
PIyrs4_Tbpl1_420 |  -770.0107   429.2092    -1.79   0.073    -1611.264    71.24284
PIyrs4_Tbpl1_421 |   1831.966    507.998     3.61   0.000     836.2857    2827.646
PIyrs4_Tbpl1_426 |  -1750.881    293.014    -5.98   0.000    -2325.191   -1176.572
PIyrs4_Tbpl1_436 |  -3141.516   428.8651    -7.33   0.000    -3982.096   -2300.937
PIyrs4_Tbpl1_450 |   215.7073   550.0982     0.39   0.695    -862.4897    1293.904
PIyrs4_Tbpl1_453 |   650.7751   296.6477     2.19   0.028     69.34314    1232.207
PIyrs4_Tbpl1_465 |    3763.97   443.2335     8.49   0.000     2895.229    4632.711
PIyrs4_Tbpl1_434 |  -497.8103   473.9319    -1.05   0.294    -1426.721    431.1001
PIyrs5_Tbpl1_400 |  -967.0982   464.4374    -2.08   0.037    -1877.399   -56.79706
PIyrs5_Tbpl1_401 |  -3909.209   593.6524    -6.59   0.000    -5072.773   -2745.646
PIyrs5_Tbpl1_404 |  -3051.162   647.7521    -4.71   0.000    -4320.761   -1781.562
PIyrs5_Tbpl1_405 |   -860.875   646.6912    -1.33   0.183    -2128.395     406.645
PIyrs5_Tbpl1_410 |   2782.673   561.5085     4.96   0.000     1682.111    3883.234
PIyrs5_Tbpl1_411 |   3048.093   352.1348     8.66   0.000     2357.906     3738.28
PIyrs5_Tbpl1_412 |   1937.801   420.7136     4.61   0.000     1113.199    2762.403
PIyrs5_Tbpl1_414 |   1735.039   535.7666     3.24   0.001     684.9316    2785.146
PIyrs5_Tbpl1_420 |   -1254.65   601.5126    -2.09   0.037     -2433.62   -75.68012
PIyrs5_Tbpl1_421 |   1757.274    626.759     2.80   0.005     528.8214    2985.727
PIyrs5_Tbpl1_426 |  -1429.617   394.6868    -3.62   0.000    -2203.207   -656.0278
PIyrs5_Tbpl1_436 |  -3221.386   680.2588    -4.74   0.000    -4554.699   -1888.073
PIyrs5_Tbpl1_450 |   1735.305   1020.097     1.70   0.089    -264.0937    3734.704
PIyrs5_Tbpl1_453 |  -108.3976   385.0255    -0.28   0.778    -863.0507    646.2555
PIyrs5_Tbpl1_465 |   3322.705   720.2898     4.61   0.000     1910.931    4734.479
PIyrs5_Tbpl1_434 |   280.7538   953.0926     0.29   0.768    -1587.316    2148.823
      Yyear_1910 |   1361.112    493.302     2.76   0.006     394.2362    2327.988
      Yyear_1920 |   3100.375   683.4918     4.54   0.000     1760.726    4440.025
           _cons |  -39023.32   20655.21    -1.89   0.059     -79507.7    1461.058
----------------------------------------------------------------------------------

. test (PIyrs1_Tbpl1_400-PIyrs5_Tbpl1_400)==0

 ( 1)  PIyrs1_Tbpl1_400 - PIyrs5_Tbpl1_400 = 0

       F(  1, 53548) =    1.43
            Prob > F =    0.2310

. test (PIyrs1_Tbpl1_401-PIyrs5_Tbpl1_401)==0

 ( 1)  PIyrs1_Tbpl1_401 - PIyrs5_Tbpl1_401 = 0

       F(  1, 53548) =   13.82
            Prob > F =    0.0002

. test (PIyrs1_Tbpl1_404-PIyrs5_Tbpl1_404)==0

 ( 1)  PIyrs1_Tbpl1_404 - PIyrs5_Tbpl1_404 = 0

       F(  1, 53548) =    0.88
            Prob > F =    0.3496

. test (PIyrs1_Tbpl1_405-PIyrs5_Tbpl1_405)==0

 ( 1)  PIyrs1_Tbpl1_405 - PIyrs5_Tbpl1_405 = 0

       F(  1, 53548) =    0.02
            Prob > F =    0.8827

. test (PIyrs1_Tbpl1_410-PIyrs5_Tbpl1_410)==0

 ( 1)  PIyrs1_Tbpl1_410 - PIyrs5_Tbpl1_410 = 0

       F(  1, 53548) =    0.06
            Prob > F =    0.7992

. test (PIyrs1_Tbpl1_411-PIyrs5_Tbpl1_411)==0

 ( 1)  PIyrs1_Tbpl1_411 - PIyrs5_Tbpl1_411 = 0

       F(  1, 53548) =    1.17
            Prob > F =    0.2804

. test (PIyrs1_Tbpl1_412-PIyrs5_Tbpl1_412)==0

 ( 1)  PIyrs1_Tbpl1_412 - PIyrs5_Tbpl1_412 = 0

       F(  1, 53548) =    1.23
            Prob > F =    0.2683

. test (PIyrs1_Tbpl1_414-PIyrs5_Tbpl1_414)==0

 ( 1)  PIyrs1_Tbpl1_414 - PIyrs5_Tbpl1_414 = 0

       F(  1, 53548) =    2.78
            Prob > F =    0.0956

. test (PIyrs1_Tbpl1_420-PIyrs5_Tbpl1_420)==0

 ( 1)  PIyrs1_Tbpl1_420 - PIyrs5_Tbpl1_420 = 0

       F(  1, 53548) =    1.06
            Prob > F =    0.3039

. test (PIyrs1_Tbpl1_421-PIyrs5_Tbpl1_421)==0

 ( 1)  PIyrs1_Tbpl1_421 - PIyrs5_Tbpl1_421 = 0

       F(  1, 53548) =    0.00
            Prob > F =    0.9502

. test (PIyrs1_Tbpl1_426-PIyrs5_Tbpl1_426)==0

 ( 1)  PIyrs1_Tbpl1_426 - PIyrs5_Tbpl1_426 = 0

       F(  1, 53548) =    0.82
            Prob > F =    0.3659

. test (PIyrs1_Tbpl1_434-PIyrs5_Tbpl1_434)==0

 ( 1)  PIyrs1_Tbpl1_434 - PIyrs5_Tbpl1_434 = 0

       F(  1, 53548) =    0.00
            Prob > F =    0.9674

. test (PIyrs1_Tbpl1_436-PIyrs5_Tbpl1_436)==0

 ( 1)  PIyrs1_Tbpl1_436 - PIyrs5_Tbpl1_436 = 0

       F(  1, 53548) =    0.80
            Prob > F =    0.3719

. test (PIyrs1_Tbpl1_450-PIyrs5_Tbpl1_450)==0

 ( 1)  PIyrs1_Tbpl1_450 - PIyrs5_Tbpl1_450 = 0

       F(  1, 53548) =    1.56
            Prob > F =    0.2114

. test (PIyrs1_Tbpl1_453-PIyrs5_Tbpl1_453)==0

 ( 1)  PIyrs1_Tbpl1_453 - PIyrs5_Tbpl1_453 = 0

       F(  1, 53548) =    0.68
            Prob > F =    0.4101

. test (PIyrs1_Tbpl1_465-PIyrs5_Tbpl1_465)==0

 ( 1)  PIyrs1_Tbpl1_465 - PIyrs5_Tbpl1_465 = 0

       F(  1, 53548) =    0.51
            Prob > F =    0.4753

. 
. 
. /* Figure 3 (black bars) - Initial immigrant arrivals (0-5 yrs) vs. natives in panel by country*/
. /* Reports (coeff. on PIyrs1 + coeff. on Panel) by country*/
. /* Figure 3 (gray bars) - Long-term immigrants (30+ yrs) vs. natives in panel by country*/
. /* Reports (coeff. on PIyrs5 + coeff. on Panel) by country*/
. 
. /* Figure 4 - Cohort quality. Compare cohort effect for longest-standing (arrive 1880-85) to most recent arrival (1895-1900) in panel sample*/
. gen Cohd_Panel=(yrimmig<=1885 & panel_flag==1 & bpl>100)

. foreach var of varlist T* {
  2. gen PCohc_`var'=`var'*Cohc_Panel
  3. gen PCohd_`var'=`var'*Cohd_Panel
  4. }
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)

. reg occscore_all age age2 age3 age4 PIyrsusa2_1-PIyrsusa2_5 T* PCohc* PCohd* Coha_Panel  Y* [pw=weight2] if panel_flag==1
(sum of wgt is   4.3359e+04)
note: Tbpl1_420 omitted because of collinearity

Linear regression                                      Number of obs =   53635
                                                       F( 59, 53575) =   70.84
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0364
                                                       Root MSE      =  9936.6

---------------------------------------------------------------------------------
                |               Robust
   occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
            age |   5911.109   2559.234     2.31   0.021     894.9899    10927.23
           age2 |  -213.5305   113.8994    -1.87   0.061    -436.7743    9.713294
           age3 |   3.376411   2.161013     1.56   0.118    -.8591924    7.612015
           age4 |  -.0200206   .0148241    -1.35   0.177    -.0490759    .0090347
    PIyrsusa2_1 |  -510.1886   448.3619    -1.14   0.255    -1388.982    368.6044
    PIyrsusa2_2 |  -767.2718   371.5681    -2.06   0.039    -1495.548   -38.99528
    PIyrsusa2_3 |   -717.117   321.6181    -2.23   0.026    -1347.491    -86.7429
    PIyrsusa2_4 |   -1071.77   371.2816    -2.89   0.004    -1799.485   -344.0554
    PIyrsusa2_5 |  -1078.846   523.6826    -2.06   0.039    -2105.269   -52.42396
      Tbpl1_400 |  -738.3914    281.577    -2.62   0.009    -1290.285   -186.4982
      Tbpl1_401 |   -2286.52   292.5367    -7.82   0.000    -2859.894   -1713.146
      Tbpl1_404 |  -2426.124   402.0351    -6.03   0.000    -3214.116   -1638.132
      Tbpl1_405 |  -52.50985   347.8775    -0.15   0.880    -734.3526    629.3329
      Tbpl1_410 |   3051.943   357.4598     8.54   0.000     2351.319    3752.567
      Tbpl1_411 |   3748.704    268.796    13.95   0.000     3221.861    4275.546
      Tbpl1_412 |   2048.937   303.7149     6.75   0.000     1453.654    2644.221
      Tbpl1_414 |   2230.707   308.8498     7.22   0.000     1625.358    2836.055
      Tbpl1_420 |          0  (omitted)
      Tbpl1_421 |   2197.148   389.3886     5.64   0.000     1433.943    2960.353
      Tbpl1_426 |  -968.8116   274.3056    -3.53   0.000    -1506.453   -431.1704
      Tbpl1_436 |  -3798.834   345.3988   -11.00   0.000    -4475.818   -3121.849
      Tbpl1_450 |   1955.641    406.967     4.81   0.000     1157.982      2753.3
      Tbpl1_453 |   1310.556   285.4358     4.59   0.000     751.0995    1870.013
      Tbpl1_465 |   4688.396   360.3109    13.01   0.000     3982.184    5394.609
      Tbpl1_434 |   1116.931    355.745     3.14   0.002     419.6678    1814.194
PCohc_Tbpl1_400 |  -510.0224   543.3652    -0.94   0.348    -1575.023    554.9778
PCohc_Tbpl1_401 |  -28.20246    354.011    -0.08   0.937     -722.067     665.662
PCohc_Tbpl1_404 |  -970.2127   769.7835    -1.26   0.208    -2478.995    538.5693
PCohc_Tbpl1_405 |  -499.7207   570.4544    -0.88   0.381    -1617.816    618.3746
PCohc_Tbpl1_410 |   474.3062   803.7615     0.59   0.555    -1101.073    2049.685
PCohc_Tbpl1_411 |  -807.5296   385.6464    -2.09   0.036      -1563.4   -51.65958
PCohc_Tbpl1_412 |   63.54605    455.779     0.14   0.889    -829.7846    956.8767
PCohc_Tbpl1_414 |  -745.1935   417.2207    -1.79   0.074     -1562.95    72.56252
PCohc_Tbpl1_420 |  -371.0717   884.7865    -0.42   0.675    -2105.261    1363.117
PCohc_Tbpl1_421 |   331.7249   801.1833     0.41   0.679    -1238.601    1902.051
PCohc_Tbpl1_426 |  -695.4711    389.813    -1.78   0.074    -1459.508    68.56548
PCohc_Tbpl1_436 |   710.9227   552.0529     1.29   0.198    -371.1055    1792.951
PCohc_Tbpl1_450 |  -1680.906   522.6547    -3.22   0.001    -2705.313   -656.4983
PCohc_Tbpl1_453 |  -329.2807   516.2863    -0.64   0.524    -1341.206    682.6447
PCohc_Tbpl1_465 |  -1637.023   514.5516    -3.18   0.001    -2645.549   -628.4982
PCohc_Tbpl1_434 |  -508.7026   335.9617    -1.51   0.130     -1167.19     149.785
PCohd_Tbpl1_400 |   56.25581   359.9427     0.16   0.876    -649.2349    761.7465
PCohd_Tbpl1_401 |  -174.3511    550.977    -0.32   0.752    -1254.271    905.5685
PCohd_Tbpl1_404 |   454.2715   543.2014     0.84   0.403    -610.4076    1518.951
PCohd_Tbpl1_405 |   548.0922   621.1714     0.88   0.378     -669.409    1765.593
PCohd_Tbpl1_410 |   317.1131   462.0563     0.69   0.493    -588.5211    1222.747
PCohd_Tbpl1_411 |   113.4859   278.7712     0.41   0.684    -432.9079    659.8797
PCohd_Tbpl1_412 |   1010.277   353.6221     2.86   0.004     317.1749    1703.379
PCohd_Tbpl1_414 |  -113.2771   442.3347    -0.26   0.798    -980.2567    753.7026
PCohd_Tbpl1_420 |  -747.3608   602.8745    -1.24   0.215        -1929    434.2781
PCohd_Tbpl1_421 |   99.29367   573.9747     0.17   0.863    -1025.701    1224.289
PCohd_Tbpl1_426 |   603.2483   294.9281     2.05   0.041     25.18674     1181.31
PCohd_Tbpl1_436 |   1649.819    519.821     3.17   0.002     630.9658    2668.673
PCohd_Tbpl1_450 |   306.3454   1048.221     0.29   0.770    -1748.176    2360.867
PCohd_Tbpl1_453 |   99.21209   305.9274     0.32   0.746    -500.4081    698.8323
PCohd_Tbpl1_465 |  -188.9235   654.7609    -0.29   0.773     -1472.26    1094.413
PCohd_Tbpl1_434 |   1031.719   605.1979     1.70   0.088    -154.4735    2217.912
     Coha_Panel |    211.209   202.9867     1.04   0.298    -186.6465    609.0646
     Yyear_1910 |   1418.428   500.6552     2.83   0.005     437.1399    2399.716
     Yyear_1920 |   3176.721   705.8003     4.50   0.000     1793.347    4560.096
          _cons |  -39083.59   20594.11    -1.90   0.058    -79448.23    1281.039
---------------------------------------------------------------------------------

. test (PCohc_Tbpl1_400-PCohd_Tbpl1_400)==0

 ( 1)  PCohc_Tbpl1_400 - PCohd_Tbpl1_400 = 0

       F(  1, 53575) =    0.78
            Prob > F =    0.3786

. test (PCohc_Tbpl1_401-PCohd_Tbpl1_401)==0

 ( 1)  PCohc_Tbpl1_401 - PCohd_Tbpl1_401 = 0

       F(  1, 53575) =    0.05
            Prob > F =    0.8187

. test (PCohc_Tbpl1_404-PCohd_Tbpl1_404)==0

 ( 1)  PCohc_Tbpl1_404 - PCohd_Tbpl1_404 = 0

       F(  1, 53575) =    2.91
            Prob > F =    0.0883

. test (PCohc_Tbpl1_405-PCohd_Tbpl1_405)==0

 ( 1)  PCohc_Tbpl1_405 - PCohd_Tbpl1_405 = 0

       F(  1, 53575) =    1.83
            Prob > F =    0.1767

. test (PCohc_Tbpl1_410-PCohd_Tbpl1_410)==0

 ( 1)  PCohc_Tbpl1_410 - PCohd_Tbpl1_410 = 0

       F(  1, 53575) =    0.03
            Prob > F =    0.8533

. test (PCohc_Tbpl1_411-PCohd_Tbpl1_411)==0

 ( 1)  PCohc_Tbpl1_411 - PCohd_Tbpl1_411 = 0

       F(  1, 53575) =    3.86
            Prob > F =    0.0494

. test (PCohc_Tbpl1_412-PCohd_Tbpl1_412)==0

 ( 1)  PCohc_Tbpl1_412 - PCohd_Tbpl1_412 = 0

       F(  1, 53575) =    3.34
            Prob > F =    0.0676

. test (PCohc_Tbpl1_414-PCohd_Tbpl1_414)==0

 ( 1)  PCohc_Tbpl1_414 - PCohd_Tbpl1_414 = 0

       F(  1, 53575) =    1.28
            Prob > F =    0.2583

. test (PCohc_Tbpl1_420-PCohd_Tbpl1_420)==0

 ( 1)  PCohc_Tbpl1_420 - PCohd_Tbpl1_420 = 0

       F(  1, 53575) =    0.14
            Prob > F =    0.7112

. test (PCohc_Tbpl1_421-PCohd_Tbpl1_421)==0

 ( 1)  PCohc_Tbpl1_421 - PCohd_Tbpl1_421 = 0

       F(  1, 53575) =    0.07
            Prob > F =    0.7937

. test (PCohc_Tbpl1_426-PCohd_Tbpl1_426)==0

 ( 1)  PCohc_Tbpl1_426 - PCohd_Tbpl1_426 = 0

       F(  1, 53575) =    7.92
            Prob > F =    0.0049

. test (PCohc_Tbpl1_434-PCohd_Tbpl1_434)==0

 ( 1)  PCohc_Tbpl1_434 - PCohd_Tbpl1_434 = 0

       F(  1, 53575) =    5.99
            Prob > F =    0.0144

. test (PCohc_Tbpl1_436-PCohd_Tbpl1_436)==0

 ( 1)  PCohc_Tbpl1_436 - PCohd_Tbpl1_436 = 0

       F(  1, 53575) =    1.83
            Prob > F =    0.1765

. test (PCohc_Tbpl1_450-PCohd_Tbpl1_450)==0

 ( 1)  PCohc_Tbpl1_450 - PCohd_Tbpl1_450 = 0

       F(  1, 53575) =    3.36
            Prob > F =    0.0667

. test (PCohc_Tbpl1_453-PCohd_Tbpl1_453)==0

 ( 1)  PCohc_Tbpl1_453 - PCohd_Tbpl1_453 = 0

       F(  1, 53575) =    0.59
            Prob > F =    0.4440

. test (PCohc_Tbpl1_465-PCohd_Tbpl1_465)==0

 ( 1)  PCohc_Tbpl1_465 - PCohd_Tbpl1_465 = 0

       F(  1, 53575) =    3.83
            Prob > F =    0.0505

. 
. /* Figure 5 - Return migrants. Compare "occupational growth" between recent arrivals (0-5 yr) and long-term migrants (30+ yrs) in the cross section and the 
> panel*/
. foreach var of varlist T* {
  2. gen CSIyrs1_`var'=`var'*(1-panel_flag)*Iyrsusa2_1
  3. gen CSIyrs4_`var'=`var'*(1-panel_flag)*Iyrsusa2_4
  4. }
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(3139 missing values generated)
(1017 missing values generated)
(1017 missing values generated)

. #delimit ;
delimiter now ;
. reg occscore_all age age2 age3 age4 PIyrs1* PIyrs4* CSIyrs1* CSIyrs4* Y* C1 PC1 [pw=weight2] if (fb==0 | PIyrsusa2_1==1 | PIyrsusa2_4==1 | Iyrsusa2_1==1 | 
> Iyrsusa2_4==1);
(sum of wgt is   2.1965e+05)

Linear regression                                      Number of obs =  203652
                                                       F( 72,203579) =   98.96
                                                       Prob > F      =  0.0000
                                                       R-squared     =  0.0334
                                                       Root MSE      =   10066

-----------------------------------------------------------------------------------
                  |               Robust
     occscore_all |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
------------------+----------------------------------------------------------------
              age |   3030.556   656.4282     4.62   0.000     1743.972    4317.139
             age2 |  -88.70867   29.44481    -3.01   0.003    -146.4198   -30.99755
             age3 |   1.127091   .5633635     2.00   0.045     .0229125     2.23127
             age4 |  -.0053897   .0038983    -1.38   0.167    -.0130303    .0022509
 PIyrs1_Tbpl1_400 |  -1789.953    846.096    -2.12   0.034     -3448.28   -131.6252
 PIyrs1_Tbpl1_401 |  -739.7219   450.0833    -1.64   0.100    -1621.874    142.4303
 PIyrs1_Tbpl1_404 |  -3766.316   1029.525    -3.66   0.000     -5784.16   -1748.472
 PIyrs1_Tbpl1_405 |  -556.9855   685.0486    -0.81   0.416    -1899.664    785.6931
 PIyrs1_Tbpl1_410 |   3397.289   947.4103     3.59   0.000     1540.387     5254.19
 PIyrs1_Tbpl1_411 |   2761.599   505.0125     5.47   0.000     1771.786    3751.411
 PIyrs1_Tbpl1_412 |   3092.662   713.4968     4.33   0.000     1694.226    4491.098
 PIyrs1_Tbpl1_414 |   971.5817   459.4266     2.11   0.034     71.11671    1872.047
 PIyrs1_Tbpl1_420 |  -2380.496   1150.282    -2.07   0.039     -4635.02   -125.9725
 PIyrs1_Tbpl1_421 |   1928.617   1054.307     1.83   0.067    -137.7991    3995.032
 PIyrs1_Tbpl1_426 |  -1794.008   567.6415    -3.16   0.002    -2906.572    -681.445
 PIyrs1_Tbpl1_436 |  -3921.748   743.2831    -5.28   0.000    -5378.565   -2464.931
 PIyrs1_Tbpl1_450 |   723.1293   427.4882     1.69   0.091     -114.737    1560.996
 PIyrs1_Tbpl1_453 |    960.022   814.2292     1.18   0.238    -635.8474    2555.891
 PIyrs1_Tbpl1_465 |   2968.366   621.2125     4.78   0.000     1750.805    4185.928
 PIyrs1_Tbpl1_434 |   688.3649   347.8718     1.98   0.048     6.544608    1370.185
 PIyrs4_Tbpl1_400 |  -2007.458   226.4506    -8.86   0.000    -2451.296    -1563.62
 PIyrs4_Tbpl1_401 |  -4295.802   274.6407   -15.64   0.000    -4834.091   -3757.513
 PIyrs4_Tbpl1_404 |  -3862.843   406.5822    -9.50   0.000    -4659.734   -3065.952
 PIyrs4_Tbpl1_405 |  -1260.492   382.1234    -3.30   0.001    -2009.445   -511.5396
 PIyrs4_Tbpl1_410 |   1818.031   344.9565     5.27   0.000     1141.925    2494.137
 PIyrs4_Tbpl1_411 |   2631.876     174.44    15.09   0.000     2289.978    2973.774
 PIyrs4_Tbpl1_412 |   1471.527   236.0765     6.23   0.000     1008.823    1934.231
 PIyrs4_Tbpl1_414 |   966.6449   290.9036     3.32   0.001      396.481    1536.809
 PIyrs4_Tbpl1_420 |  -874.6348   382.2994    -2.29   0.022    -1623.932   -125.3373
 PIyrs4_Tbpl1_421 |   1570.247    457.887     3.43   0.001     672.7995    2467.694
 PIyrs4_Tbpl1_426 |  -2026.841   190.8297   -10.62   0.000    -2400.863    -1652.82
 PIyrs4_Tbpl1_436 |  -3326.273   375.7107    -8.85   0.000    -4062.657    -2589.89
 PIyrs4_Tbpl1_450 |   191.1756    512.609     0.37   0.709    -813.5255    1195.877
 PIyrs4_Tbpl1_453 |   456.6372   210.8472     2.17   0.030     43.38179    869.8927
 PIyrs4_Tbpl1_465 |   3772.522   395.1649     9.55   0.000     2998.009    4547.036
 PIyrs4_Tbpl1_434 |   128.7522   329.9238     0.39   0.696    -517.8904    775.3947
CSIyrs1_Tbpl1_400 |  -3765.882   967.9512    -3.89   0.000    -5663.043   -1868.722
CSIyrs1_Tbpl1_401 |   490.8041   379.6407     1.29   0.196    -253.2825    1234.891
CSIyrs1_Tbpl1_404 |  -3266.109    697.943    -4.68   0.000     -4634.06   -1898.158
CSIyrs1_Tbpl1_405 |  -671.8521   528.3163    -1.27   0.203    -1707.339     363.635
CSIyrs1_Tbpl1_410 |   1224.859   592.2995     2.07   0.039     63.96639    2385.751
CSIyrs1_Tbpl1_411 |   2432.746   1586.942     1.53   0.125    -677.6223    5543.114
CSIyrs1_Tbpl1_412 |    2417.88   1924.244     1.26   0.209    -1353.591     6189.35
CSIyrs1_Tbpl1_414 |    222.862   369.7328     0.60   0.547    -501.8053    947.5292
CSIyrs1_Tbpl1_420 |   192.8813   1225.034     0.16   0.875    -2208.156    2593.918
CSIyrs1_Tbpl1_421 |   1381.862   984.4369     1.40   0.160    -547.6104    3311.334
CSIyrs1_Tbpl1_426 |  -3744.074   1280.118    -2.92   0.003    -6253.074   -1235.075
CSIyrs1_Tbpl1_436 |  -4429.294   1197.581    -3.70   0.000    -6776.523   -2082.064
CSIyrs1_Tbpl1_450 |   591.7215     317.66     1.86   0.062    -30.88434    1214.327
CSIyrs1_Tbpl1_453 |   182.2334   438.7924     0.42   0.678     -677.789    1042.256
CSIyrs1_Tbpl1_465 |  -329.6155   433.5179    -0.76   0.447      -1179.3     520.069
CSIyrs1_Tbpl1_434 |  -814.8952   270.7056    -3.01   0.003    -1345.471   -284.3188
CSIyrs4_Tbpl1_400 |  -2159.833   551.3592    -3.92   0.000    -3240.483   -1079.182
CSIyrs4_Tbpl1_401 |  -3709.005   611.4635    -6.07   0.000    -4907.458   -2510.551
CSIyrs4_Tbpl1_404 |   -2171.83   458.7993    -4.73   0.000    -3071.066   -1272.595
CSIyrs4_Tbpl1_405 |  -1216.168   296.0463    -4.11   0.000    -1796.412   -635.9246
CSIyrs4_Tbpl1_410 |   2326.711   294.9158     7.89   0.000     1748.683    2904.739
CSIyrs4_Tbpl1_411 |   2815.052   475.0462     5.93   0.000     1883.973    3746.131
CSIyrs4_Tbpl1_412 |   1575.842   994.9148     1.58   0.113    -374.1663    3525.851
CSIyrs4_Tbpl1_414 |   504.5056   220.0307     2.29   0.022      73.2508    935.7603
CSIyrs4_Tbpl1_420 |  -4056.772   700.6827    -5.79   0.000    -5430.093   -2683.451
CSIyrs4_Tbpl1_421 |   160.6843   765.7523     0.21   0.834    -1340.172     1661.54
CSIyrs4_Tbpl1_426 |  -1244.333   778.8067    -1.60   0.110    -2770.775    282.1093
CSIyrs4_Tbpl1_436 |  -3750.086   728.5989    -5.15   0.000    -5178.122    -2322.05
CSIyrs4_Tbpl1_450 |   625.0212    328.294     1.90   0.057    -18.42694    1268.469
CSIyrs4_Tbpl1_453 |  -45.18547   186.7754    -0.24   0.809    -411.2607    320.8898
CSIyrs4_Tbpl1_465 |   3896.177   332.0733    11.73   0.000     3245.321    4547.033
CSIyrs4_Tbpl1_434 |   .8211765   275.5868     0.00   0.998    -539.3221    540.9645
       Yyear_1910 |   879.0978   118.4279     7.42   0.000     646.9821    1111.214
       Yyear_1920 |   1720.081   164.5586    10.45   0.000      1397.55    2042.612
               C1 |  -558.8114   197.5417    -2.83   0.005    -945.9884   -171.6345
              PC1 |   198.5319   272.4695     0.73   0.466    -335.5016    732.5655
            _cons |  -15830.45   5247.499    -3.02   0.003    -26115.43   -5545.484
-----------------------------------------------------------------------------------

. #delimit cr
delimiter now cr
. 
. test ((CSIyrs4_Tbpl1_400-CSIyrs1_Tbpl1_400)-(PIyrs4_Tbpl1_400-PIyrs1_Tbpl1_400))==0

 ( 1)  PIyrs1_Tbpl1_400 - PIyrs4_Tbpl1_400 - CSIyrs1_Tbpl1_400 + CSIyrs4_Tbpl1_400 = 0

       F(  1,203579) =    1.72
            Prob > F =    0.1893

. test ((CSIyrs4_Tbpl1_401-CSIyrs1_Tbpl1_401)-(PIyrs4_Tbpl1_401-PIyrs1_Tbpl1_401))==0

 ( 1)  PIyrs1_Tbpl1_401 - PIyrs4_Tbpl1_401 - CSIyrs1_Tbpl1_401 + CSIyrs4_Tbpl1_401 = 0

       F(  1,203579) =    0.61
            Prob > F =    0.4366

. test ((CSIyrs4_Tbpl1_404-CSIyrs1_Tbpl1_404)-(PIyrs4_Tbpl1_404-PIyrs1_Tbpl1_404))==0

 ( 1)  PIyrs1_Tbpl1_404 - PIyrs4_Tbpl1_404 - CSIyrs1_Tbpl1_404 + CSIyrs4_Tbpl1_404 = 0

       F(  1,203579) =    0.77
            Prob > F =    0.3803

. test ((CSIyrs4_Tbpl1_405-CSIyrs1_Tbpl1_405)-(PIyrs4_Tbpl1_405-PIyrs1_Tbpl1_405))==0

 ( 1)  PIyrs1_Tbpl1_405 - PIyrs4_Tbpl1_405 - CSIyrs1_Tbpl1_405 + CSIyrs4_Tbpl1_405 = 0

       F(  1,203579) =    0.03
            Prob > F =    0.8663

. test ((CSIyrs4_Tbpl1_410-CSIyrs1_Tbpl1_410)-(PIyrs4_Tbpl1_410-PIyrs1_Tbpl1_410))==0

 ( 1)  PIyrs1_Tbpl1_410 - PIyrs4_Tbpl1_410 - CSIyrs1_Tbpl1_410 + CSIyrs4_Tbpl1_410 = 0

       F(  1,203579) =    5.18
            Prob > F =    0.0228

. test ((CSIyrs4_Tbpl1_411-CSIyrs1_Tbpl1_411)-(PIyrs4_Tbpl1_411-PIyrs1_Tbpl1_411))==0

 ( 1)  PIyrs1_Tbpl1_411 - PIyrs4_Tbpl1_411 - CSIyrs1_Tbpl1_411 + CSIyrs4_Tbpl1_411 = 0

       F(  1,203579) =    0.09
            Prob > F =    0.7663

. test ((CSIyrs4_Tbpl1_412-CSIyrs1_Tbpl1_412)-(PIyrs4_Tbpl1_412-PIyrs1_Tbpl1_412))==0

 ( 1)  PIyrs1_Tbpl1_412 - PIyrs4_Tbpl1_412 - CSIyrs1_Tbpl1_412 + CSIyrs4_Tbpl1_412 = 0

       F(  1,203579) =    0.12
            Prob > F =    0.7325

. test ((CSIyrs4_Tbpl1_414-CSIyrs1_Tbpl1_414)-(PIyrs4_Tbpl1_414-PIyrs1_Tbpl1_414))==0

 ( 1)  PIyrs1_Tbpl1_414 - PIyrs4_Tbpl1_414 - CSIyrs1_Tbpl1_414 + CSIyrs4_Tbpl1_414 = 0

       F(  1,203579) =    0.21
            Prob > F =    0.6504

. test ((CSIyrs4_Tbpl1_420-CSIyrs1_Tbpl1_420)-(PIyrs4_Tbpl1_420-PIyrs1_Tbpl1_420))==0

 ( 1)  PIyrs1_Tbpl1_420 - PIyrs4_Tbpl1_420 - CSIyrs1_Tbpl1_420 + CSIyrs4_Tbpl1_420 = 0

       F(  1,203579) =    9.82
            Prob > F =    0.0017

. test ((CSIyrs4_Tbpl1_421-CSIyrs1_Tbpl1_421)-(PIyrs4_Tbpl1_421-PIyrs1_Tbpl1_421))==0

 ( 1)  PIyrs1_Tbpl1_421 - PIyrs4_Tbpl1_421 - CSIyrs1_Tbpl1_421 + CSIyrs4_Tbpl1_421 = 0

       F(  1,203579) =    0.27
            Prob > F =    0.6054

. test ((CSIyrs4_Tbpl1_426-CSIyrs1_Tbpl1_426)-(PIyrs4_Tbpl1_426-PIyrs1_Tbpl1_426))==0

 ( 1)  PIyrs1_Tbpl1_426 - PIyrs4_Tbpl1_426 - CSIyrs1_Tbpl1_426 + CSIyrs4_Tbpl1_426 = 0

       F(  1,203579) =    2.95
            Prob > F =    0.0857

. test ((CSIyrs4_Tbpl1_434-CSIyrs1_Tbpl1_434)-(PIyrs4_Tbpl1_434-PIyrs1_Tbpl1_434))==0

 ( 1)  PIyrs1_Tbpl1_434 - PIyrs4_Tbpl1_434 - CSIyrs1_Tbpl1_434 + CSIyrs4_Tbpl1_434 = 0

       F(  1,203579) =    7.24
            Prob > F =    0.0071

. test ((CSIyrs4_Tbpl1_436-CSIyrs1_Tbpl1_436)-(PIyrs4_Tbpl1_436-PIyrs1_Tbpl1_436))==0

 ( 1)  PIyrs1_Tbpl1_436 - PIyrs4_Tbpl1_436 - CSIyrs1_Tbpl1_436 + CSIyrs4_Tbpl1_436 = 0

       F(  1,203579) =    0.00
            Prob > F =    0.9584

. test ((CSIyrs4_Tbpl1_450-CSIyrs1_Tbpl1_450)-(PIyrs4_Tbpl1_450-PIyrs1_Tbpl1_450))==0

 ( 1)  PIyrs1_Tbpl1_450 - PIyrs4_Tbpl1_450 - CSIyrs1_Tbpl1_450 + CSIyrs4_Tbpl1_450 = 0

       F(  1,203579) =    0.58
            Prob > F =    0.4460

. test ((CSIyrs4_Tbpl1_453-CSIyrs1_Tbpl1_453)-(PIyrs4_Tbpl1_453-PIyrs1_Tbpl1_453))==0

 ( 1)  PIyrs1_Tbpl1_453 - PIyrs4_Tbpl1_453 - CSIyrs1_Tbpl1_453 + CSIyrs4_Tbpl1_453 = 0

       F(  1,203579) =    0.09
            Prob > F =    0.7671

. test ((CSIyrs4_Tbpl1_465-CSIyrs1_Tbpl1_465)-(PIyrs4_Tbpl1_465-PIyrs1_Tbpl1_465))==0

 ( 1)  PIyrs1_Tbpl1_465 - PIyrs4_Tbpl1_465 - CSIyrs1_Tbpl1_465 + CSIyrs4_Tbpl1_465 = 0

       F(  1,203579) =   15.77
            Prob > F =    0.0001

. 
. 
. 
. log close
      name:  <unnamed>
       log:  /disk/homes2c/nber/lplatt/Ran/analysis_forjpe.log
  log type:  text
 closed on:   9 Aug 2013, 20:55:02
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
